MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
extern volatile CM4CON1bits_t CM4CON1bits __at(0x11B);
// bitfield macros
#define _CM4CON1_C4NCH_POSN                                 0x0
#define _CM4CON1_C4NCH_POSITION                             0x0
#define _CM4CON1_C4NCH_SIZE                                 0x3
#define _CM4CON1_C4NCH_LENGTH                               0x3
#define _CM4CON1_C4NCH_MASK                                 0x7
#define _CM4CON1_C4PCH_POSN                                 0x3
#define _CM4CON1_C4PCH_POSITION                             0x3
#define _CM4CON1_C4PCH_SIZE                                 0x3
#define _CM4CON1_C4PCH_LENGTH                               0x3
#define _CM4CON1_C4PCH_MASK                                 0x38
#define _CM4CON1_C4INTN_POSN                                0x6
#define _CM4CON1_C4INTN_POSITION                            0x6
#define _CM4CON1_C4INTN_SIZE                                0x1
#define _CM4CON1_C4INTN_LENGTH                              0x1
#define _CM4CON1_C4INTN_MASK                                0x40
#define _CM4CON1_C4INTP_POSN                                0x7
#define _CM4CON1_C4INTP_POSITION                            0x7
#define _CM4CON1_C4INTP_SIZE                                0x1
#define _CM4CON1_C4INTP_LENGTH                              0x1
#define _CM4CON1_C4INTP_MASK                                0x80
#define _CM4CON1_C4NCH0_POSN                                0x0
#define _CM4CON1_C4NCH0_POSITION                            0x0
#define _CM4CON1_C4NCH0_SIZE                                0x1
#define _CM4CON1_C4NCH0_LENGTH                              0x1
#define _CM4CON1_C4NCH0_MASK                                0x1
#define _CM4CON1_C4NCH1_POSN                                0x1
#define _CM4CON1_C4NCH1_POSITION                            0x1
#define _CM4CON1_C4NCH1_SIZE                                0x1
#define _CM4CON1_C4NCH1_LENGTH                              0x1
#define _CM4CON1_C4NCH1_MASK                                0x2
#define _CM4CON1_C4NCH2_POSN                                0x2
#define _CM4CON1_C4NCH2_POSITION                            0x2
#define _CM4CON1_C4NCH2_SIZE                                0x1
#define _CM4CON1_C4NCH2_LENGTH                              0x1
#define _CM4CON1_C4NCH2_MASK                                0x4
#define _CM4CON1_C4PCH0_POSN                                0x3
#define _CM4CON1_C4PCH0_POSITION                            0x3
#define _CM4CON1_C4PCH0_SIZE                                0x1
#define _CM4CON1_C4PCH0_LENGTH                              0x1
#define _CM4CON1_C4PCH0_MASK                                0x8
#define _CM4CON1_C4PCH1_POSN                                0x4
#define _CM4CON1_C4PCH1_POSITION                            0x4
#define _CM4CON1_C4PCH1_SIZE                                0x1
#define _CM4CON1_C4PCH1_LENGTH                              0x1
#define _CM4CON1_C4PCH1_MASK                                0x10
#define _CM4CON1_C4PCH2_POSN                                0x5
#define _CM4CON1_C4PCH2_POSITION                            0x5
#define _CM4CON1_C4PCH2_SIZE                                0x1
#define _CM4CON1_C4PCH2_LENGTH                              0x1
#define _CM4CON1_C4PCH2_MASK                                0x20

// Register: APFCON2
#define APFCON2 APFCON2
extern volatile unsigned char           APFCON2             __at(0x11C);
#ifndef _LIB_BUILD
asm("APFCON2 equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3SEL                :1;
        unsigned SSSEL                  :2;
    };
} APFCON2bits_t;
extern volatile APFCON2bits_t APFCON2bits __at(0x11C);
// bitfield macros
#define _APFCON2_CCP3SEL_POSN                               0x0
#define _APFCON2_CCP3SEL_POSITION                           0x0
#define _APFCON2_CCP3SEL_SIZE                               0x1
#define _APFCON2_CCP3SEL_LENGTH                             0x1
#define _APFCON2_CCP3SEL_MASK                               0x1
#define _APFCON2_SSSEL_POSN                                 0x1
#define _APFCON2_SSSEL_POSITION                             0x1
#define _APFCON2_SSSEL_SIZE                                 0x2
#define _APFCON2_SSSEL_LENGTH                               0x2
#define _APFCON2_SSSEL_MASK                                 0x6

// Register: APFCON1
#define APFCON1 APFCON1
extern volatile unsigned char           APFCON1             __at(0x11D);
#ifndef _LIB_BUILD
asm("APFCON1 equ 011Dh");
#endif
// aliases
extern volatile unsigned char           APFCON0             __at(0x11D);
#ifndef _LIB_BUILD
asm("APFCON0 equ 011Dh");
#endif
extern volatile unsigned char           APFCON              __at(0x11D);
#ifndef _LIB_BUILD
asm("APFCON equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2SEL                :1;
        unsigned RXSEL                  :1;
        unsigned TXSEL                  :1;
        unsigned SDISEL                 :1;
        unsigned SCKSEL                 :1;
        unsigned SDOSEL                 :1;
        unsigned CCP1SEL                :1;
        unsigned C2OUTSEL               :1;
    };
} APFCON1bits_t;
extern volatile APFCON1bits_t APFCON1bits __at(0x11D);
// bitfield macros
#define _APFCON1_CCP2SEL_POSN                               0x0
#define _APFCON1_CCP2SEL_POSITION                           0x0
#define _APFCON1_CCP2SEL_SIZE                               0x1
#define _APFCON1_CCP2SEL_LENGTH                             0x1
#define _APFCON1_CCP2SEL_MASK                               0x1
#define _APFCON1_RXSEL_POSN                                 0x1
#define _APFCON1_RXSEL_POSITION                             0x1
#define _APFCON1_RXSEL_SIZE                                 0x1
#define _APFCON1_RXSEL_LENGTH                               0x1
#define _APFCON1_RXSEL_MASK                                 0x2
#define _APFCON1_TXSEL_POSN                                 0x2
#define _APFCON1_TXSEL_POSITION                             0x2
#define _APFCON1_TXSEL_SIZE                                 0x1
#define _APFCON1_TXSEL_LENGTH                               0x1
#define _APFCON1_TXSEL_MASK                                 0x4
#define _APFCON1_SDISEL_POSN                                0x3
#define _APFCON1_SDISEL_POSITION                            0x3
#define _APFCON1_SDISEL_SIZE                                0x1
#define _APFCON1_SDISEL_LENGTH                              0x1
#define _APFCON1_SDISEL_MASK                                0x8
#define _APFCON1_SCKSEL_POSN                                0x4
#define _APFCON1_SCKSEL_POSITION                            0x4
#define _APFCON1_SCKSEL_SIZE                                0x1
#define _APFCON1_SCKSEL_LENGTH                              0x1
#define _APFCON1_SCKSEL_MASK                                0x10
#define _APFCON1_SDOSEL_POSN                                0x5
#define _APFCON1_SDOSEL_POSITION                            0x5
#define _APFCON1_SDOSEL_SIZE                                0x1
#define _APFCON1_SDOSEL_LENGTH                              0x1
#define _APFCON1_SDOSEL_MASK                                0x20
#define _APFCON1_CCP1SEL_POSN                               0x6
#define _APFCON1_CCP1SEL_POSITION                           0x6
#define _APFCON1_CCP1SEL_SIZE                               0x1
#define _APFCON1_CCP1SEL_LENGTH                             0x1
#define _APFCON1_CCP1SEL_MASK                               0x40
#define _APFCON1_C2OUTSEL_POSN                              0x7
#define _APFCON1_C2OUTSEL_POSITION                          0x7
#define _APFCON1_C2OUTSEL_SIZE                              0x1
#define _APFCON1_C2OUTSEL_LENGTH                            0x1
#define _APFCON1_C2OUTSEL_MASK                              0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned CCP2SEL                :1;
        unsigned RXSEL                  :1;
        unsigned TXSEL                  :1;
        unsigned SDISEL                 :1;
        unsigned SCKSEL                 :1;
        unsigned SDOSEL                 :1;
        unsigned CCP1SEL                :1;
        unsigned C2OUTSEL               :1;
    };
} APFCON0bits_t;
extern volatile APFCON0bits_t APFCON0bits __at(0x11D);
// bitfield macros
#define _APFCON0_CCP2SEL_POSN                               0x0
#define _APFCON0_CCP2SEL_POSITION                           0x0
#define _APFCON0_CCP2SEL_SIZE                               0x1
#define _APFCON0_CCP2SEL_LENGTH                             0x1
#define _APFCON0_CCP2SEL_MASK                               0x1
#define _APFCON0_RXSEL_POSN                                 0x1
#define _APFCON0_RXSEL_POSITION                             0x1
#define _APFCON0_RXSEL_SIZE                                 0x1
#define _APFCON0_RXSEL_LENGTH                               0x1
#define _APFCON0_RXSEL_MASK                                 0x2
#define _APFCON0_TXSEL_POSN                                 0x2
#define _APFCON0_TXSEL_POSITION                             0x2
#define _APFCON0_TXSEL_SIZE                                 0x1
#define _APFCON0_TXSEL_LENGTH                               0x1
#define _APFCON0_TXSEL_MASK                                 0x4
#define _APFCON0_SDISEL_POSN                                0x3
#define _APFCON0_SDISEL_POSITION                            0x3
#define _APFCON0_SDISEL_SIZE                                0x1
#define _APFCON0_SDISEL_LENGTH                              0x1
#define _APFCON0_SDISEL_MASK                                0x8
#define _APFCON0_SCKSEL_POSN                                0x4
#define _APFCON0_SCKSEL_POSITION                            0x4
#define _APFCON0_SCKSEL_SIZE                                0x1
#define _APFCON0_SCKSEL_LENGTH                              0x1
#define _APFCON0_SCKSEL_MASK                                0x10
#define _APFCON0_SDOSEL_POSN                                0x5
#define _APFCON0_SDOSEL_POSITION                            0x5
#define _APFCON0_SDOSEL_SIZE                                0x1
#define _APFCON0_SDOSEL_LENGTH                              0x1
#define _APFCON0_SDOSEL_MASK                                0x20
#define _APFCON0_CCP1SEL_POSN                               0x6
#define _APFCON0_CCP1SEL_POSITION                           0x6
#define _APFCON0_CCP1SEL_SIZE                               0x1
#define _APFCON0_CCP1SEL_LENGTH                             0x1
#define _APFCON0_CCP1SEL_MASK                               0x40
#define _APFCON0_C2OUTSEL_POSN                              0x7
#define _APFCON0_C2OUTSEL_POSITION                          0x7
#define _APFCON0_C2OUTSEL_SIZE                              0x1
#define _APFCON0_C2OUTSEL_LENGTH                            0x1
#define _APFCON0_C2OUTSEL_MASK                              0x80
typedef union {
    struct {
        unsigned CCP2SEL                :1;
        unsigned RXSEL                  :1;
        unsigned TXSEL                  :1;
        unsigned SDISEL                 :1;
        unsigned SCKSEL                 :1;
        unsigned SDOSEL                 :1;
        unsigned CCP1SEL                :1;
        unsigned C2OUTSEL               :1;
    };
} APFCONbits_t;
extern volatile APFCONbits_t APFCONbits __at(0x11D);
// bitfield macros
#define _APFCON_CCP2SEL_POSN                                0x0
#define _APFCON_CCP2SEL_POSITION                            0x0
#define _APFCON_CCP2SEL_SIZE                                0x1
#define _APFCON_CCP2SEL_LENGTH                              0x1
#define _APFCON_CCP2SEL_MASK                                0x1
#define _APFCON_RXSEL_POSN                                  0x1
#define _APFCON_RXSEL_POSITION                              0x1
#define _APFCON_RXSEL_SIZE                                  0x1
#define _APFCON_RXSEL_LENGTH                                0x1
#define _APFCON_RXSEL_MASK                                  0x2
#define _APFCON_TXSEL_POSN                                  0x2
#define _APFCON_TXSEL_POSITION                              0x2
#define _APFCON_TXSEL_SIZE                                  0x1
#define _APFCON_TXSEL_LENGTH                                0x1
#define _APFCON_TXSEL_MASK                                  0x4
#define _APFCON_SDISEL_POSN                                 0x3
#define _APFCON_SDISEL_POSITION                             0x3
#define _APFCON_SDISEL_SIZE                                 0x1
#define _APFCON_SDISEL_LENGTH                               0x1
#define _APFCON_SDISEL_MASK                                 0x8
#define _APFCON_SCKSEL_POSN                                 0x4
#define _APFCON_SCKSEL_POSITION                             0x4
#define _APFCON_SCKSEL_SIZE                                 0x1
#define _APFCON_SCKSEL_LENGTH                               0x1
#define _APFCON_SCKSEL_MASK                                 0x10
#define _APFCON_SDOSEL_POSN                                 0x5
#define _APFCON_SDOSEL_POSITION                             0x5
#define _APFCON_SDOSEL_SIZE                                 0x1
#define _APFCON_SDOSEL_LENGTH                               0x1
#define _APFCON_SDOSEL_MASK                                 0x20
#define _APFCON_CCP1SEL_POSN                                0x6
#define _APFCON_CCP1SEL_POSITION                            0x6
#define _APFCON_CCP1SEL_SIZE                                0x1
#define _APFCON_CCP1SEL_LENGTH                              0x1
#define _APFCON_CCP1SEL_MASK                                0x40
#define _APFCON_C2OUTSEL_POSN                               0x7
#define _APFCON_C2OUTSEL_POSITION                           0x7
#define _APFCON_C2OUTSEL_SIZE                               0x1
#define _APFCON_C2OUTSEL_LENGTH                             0x1
#define _APFCON_C2OUTSEL_MASK                               0x80

// Register: CM3CON0
#define CM3CON0 CM3CON0
extern volatile unsigned char           CM3CON0             __at(0x11E);
#ifndef _LIB_BUILD
asm("CM3CON0 equ 011Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C3SYNC                 :1;
        unsigned C3HYS                  :1;
        unsigned C3SP                   :1;
        unsigned C3ZLF                  :1;
        unsigned C3POL                  :1;
        unsigned C3OE                   :1;
        unsigned C3OUT                  :1;
        unsigned C3ON                   :1;
    };
} CM3CON0bits_t;
extern volatile CM3CON0bits_t CM3CON0bits __at(0x11E);
// bitfield macros
#define _CM3CON0_C3SYNC_POSN                                0x0
#define _CM3CON0_C3SYNC_POSITION                            0x0
#define _CM3CON0_C3SYNC_SIZE                                0x1
#define _CM3CON0_C3SYNC_LENGTH                              0x1
#define _CM3CON0_C3SYNC_MASK                                0x1
#define _CM3CON0_C3HYS_POSN                                 0x1
#define _CM3CON0_C3HYS_POSITION                             0x1
#define _CM3CON0_C3HYS_SIZE                                 0x1
#define _CM3CON0_C3HYS_LENGTH                               0x1
#define _CM3CON0_C3HYS_MASK                                 0x2
#define _CM3CON0_C3SP_POSN                                  0x2
#define _CM3CON0_C3SP_POSITION                              0x2
#define _CM3CON0_C3SP_SIZE                                  0x1
#define _CM3CON0_C3SP_LENGTH                                0x1
#define _CM3CON0_C3SP_MASK                                  0x4
#define _CM3CON0_C3ZLF_POSN                                 0x3
#define _CM3CON0_C3ZLF_POSITION                             0x3
#define _CM3CON0_C3ZLF_SIZE                                 0x1
#define _CM3CON0_C3ZLF_LENGTH                               0x1
#define _CM3CON0_C3ZLF_MASK                                 0x8
#define _CM3CON0_C3POL_POSN                                 0x4
#define _CM3CON0_C3POL_POSITION                             0x4
#define _CM3CON0_C3POL_SIZE                                 0x1
#define _CM3CON0_C3POL_LENGTH                               0x1
#define _CM3CON0_C3POL_MASK                                 0x10
#define _CM3CON0_C3OE_POSN                                  0x5
#define _CM3CON0_C3OE_POSITION                              0x5
#define _CM3CON0_C3OE_SIZE                                  0x1
#define _CM3CON0_C3OE_LENGTH                                0x1
#define _CM3CON0_C3OE_MASK                                  0x20
#define _CM3CON0_C3OUT_POSN                                 0x6
#define _CM3CON0_C3OUT_POSITION                             0x6
#define _CM3CON0_C3OUT_SIZE                                 0x1
#define _CM3CON0_C3OUT_LENGTH                               0x1
#define _CM3CON0_C3OUT_MASK                                 0x40
#define _CM3CON0_C3ON_POSN                                  0x7
#define _CM3CON0_C3ON_POSITION                              0x7
#define _CM3CON0_C3ON_SIZE                                  0x1
#define _CM3CON0_C3ON_LENGTH                                0x1
#define _CM3CON0_C3ON_MASK                                  0x80

// Register: CM3CON1
#define CM3CON1 CM3CON1
extern volatile unsigned char           CM3CON1             __at(0x11F);
#ifndef _LIB_BUILD
asm("CM3CON1 equ 011Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C3NCH                  :3;
        unsigned C3PCH                  :3;
        unsigned C3INTN                 :1;
        unsigned C3INTP                 :1;
    };
    struct {
        unsigned C3NCH0                 :1;
        unsigned C3NCH1                 :1;
        unsigned C3NCH2                 :1;
        unsigned C3PCH0                 :1;
        unsigned C3PCH1                 :1;
        unsigned C3PCH2                 :1;
    };
} CM3CON1bits_t;
