MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
extern volatile IOCENbits_t IOCENbits __at(0x39E);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x39F);
#ifndef _LIB_BUILD
asm("IOCEF equ 039Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x39F);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: OPA1CON
#define OPA1CON OPA1CON
extern volatile unsigned char           OPA1CON             __at(0x511);
#ifndef _LIB_BUILD
asm("OPA1CON equ 0511h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA1PCH0               :1;
        unsigned OPA1PCH1               :1;
        unsigned OPA1PCH2               :1;
    };
    struct {
        unsigned OPA1PCH                :3;
        unsigned                        :3;
        unsigned OPA1SP                 :1;
        unsigned OPA1EN                 :1;
    };
    struct {
        unsigned PCH                    :3;
        unsigned                        :3;
        unsigned SP                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
    };
} OPA1CONbits_t;
extern volatile OPA1CONbits_t OPA1CONbits __at(0x511);
// bitfield macros
#define _OPA1CON_OPA1PCH0_POSN                              0x0
#define _OPA1CON_OPA1PCH0_POSITION                          0x0
#define _OPA1CON_OPA1PCH0_SIZE                              0x1
#define _OPA1CON_OPA1PCH0_LENGTH                            0x1
#define _OPA1CON_OPA1PCH0_MASK                              0x1
#define _OPA1CON_OPA1PCH1_POSN                              0x1
#define _OPA1CON_OPA1PCH1_POSITION                          0x1
#define _OPA1CON_OPA1PCH1_SIZE                              0x1
#define _OPA1CON_OPA1PCH1_LENGTH                            0x1
#define _OPA1CON_OPA1PCH1_MASK                              0x2
#define _OPA1CON_OPA1PCH2_POSN                              0x2
#define _OPA1CON_OPA1PCH2_POSITION                          0x2
#define _OPA1CON_OPA1PCH2_SIZE                              0x1
#define _OPA1CON_OPA1PCH2_LENGTH                            0x1
#define _OPA1CON_OPA1PCH2_MASK                              0x4
#define _OPA1CON_OPA1PCH_POSN                               0x0
#define _OPA1CON_OPA1PCH_POSITION                           0x0
#define _OPA1CON_OPA1PCH_SIZE                               0x3
#define _OPA1CON_OPA1PCH_LENGTH                             0x3
#define _OPA1CON_OPA1PCH_MASK                               0x7
#define _OPA1CON_OPA1SP_POSN                                0x6
#define _OPA1CON_OPA1SP_POSITION                            0x6
#define _OPA1CON_OPA1SP_SIZE                                0x1
#define _OPA1CON_OPA1SP_LENGTH                              0x1
#define _OPA1CON_OPA1SP_MASK                                0x40
#define _OPA1CON_OPA1EN_POSN                                0x7
#define _OPA1CON_OPA1EN_POSITION                            0x7
#define _OPA1CON_OPA1EN_SIZE                                0x1
#define _OPA1CON_OPA1EN_LENGTH                              0x1
#define _OPA1CON_OPA1EN_MASK                                0x80
#define _OPA1CON_PCH_POSN                                   0x0
#define _OPA1CON_PCH_POSITION                               0x0
#define _OPA1CON_PCH_SIZE                                   0x3
#define _OPA1CON_PCH_LENGTH                                 0x3
#define _OPA1CON_PCH_MASK                                   0x7
#define _OPA1CON_SP_POSN                                    0x6
#define _OPA1CON_SP_POSITION                                0x6
#define _OPA1CON_SP_SIZE                                    0x1
#define _OPA1CON_SP_LENGTH                                  0x1
#define _OPA1CON_SP_MASK                                    0x40
#define _OPA1CON_EN_POSN                                    0x7
#define _OPA1CON_EN_POSITION                                0x7
#define _OPA1CON_EN_SIZE                                    0x1
#define _OPA1CON_EN_LENGTH                                  0x1
#define _OPA1CON_EN_MASK                                    0x80
#define _OPA1CON_PCH0_POSN                                  0x0
#define _OPA1CON_PCH0_POSITION                              0x0
#define _OPA1CON_PCH0_SIZE                                  0x1
#define _OPA1CON_PCH0_LENGTH                                0x1
#define _OPA1CON_PCH0_MASK                                  0x1
#define _OPA1CON_PCH1_POSN                                  0x1
#define _OPA1CON_PCH1_POSITION                              0x1
#define _OPA1CON_PCH1_SIZE                                  0x1
#define _OPA1CON_PCH1_LENGTH                                0x1
#define _OPA1CON_PCH1_MASK                                  0x2
#define _OPA1CON_PCH2_POSN                                  0x2
#define _OPA1CON_PCH2_POSITION                              0x2
#define _OPA1CON_PCH2_SIZE                                  0x1
#define _OPA1CON_PCH2_LENGTH                                0x1
#define _OPA1CON_PCH2_MASK                                  0x4

// Register: OPA2CON
#define OPA2CON OPA2CON
extern volatile unsigned char           OPA2CON             __at(0x513);
#ifndef _LIB_BUILD
asm("OPA2CON equ 0513h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA2PCH0               :1;
        unsigned OPA2PCH1               :1;
        unsigned OPA2PCH2               :1;
    };
    struct {
        unsigned OPA2PCH                :3;
        unsigned                        :3;
        unsigned OPA2SP                 :1;
        unsigned OPA2EN                 :1;
    };
    struct {
        unsigned PCH                    :3;
        unsigned                        :3;
        unsigned SP                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
    };
} OPA2CONbits_t;
