MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
// Register: CLKRCON
#define CLKRCON CLKRCON
extern volatile unsigned char           CLKRCON             __at(0x51A);
#ifndef _LIB_BUILD
asm("CLKRCON equ 051Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKRDIV0               :1;
        unsigned CLKRDIV1               :1;
        unsigned CLKRDIV2               :1;
        unsigned CLKRDC0                :1;
        unsigned CLKRDC1                :1;
        unsigned CLKRSLR                :1;
        unsigned CLKROE                 :1;
        unsigned CLKREN                 :1;
    };
    struct {
        unsigned CLKRDIV                :3;
        unsigned CLKRDC                 :2;
    };
} CLKRCONbits_t;
extern volatile CLKRCONbits_t CLKRCONbits __at(0x51A);
// bitfield macros
#define _CLKRCON_CLKRDIV0_POSN                              0x0
#define _CLKRCON_CLKRDIV0_POSITION                          0x0
#define _CLKRCON_CLKRDIV0_SIZE                              0x1
#define _CLKRCON_CLKRDIV0_LENGTH                            0x1
#define _CLKRCON_CLKRDIV0_MASK                              0x1
#define _CLKRCON_CLKRDIV1_POSN                              0x1
#define _CLKRCON_CLKRDIV1_POSITION                          0x1
#define _CLKRCON_CLKRDIV1_SIZE                              0x1
#define _CLKRCON_CLKRDIV1_LENGTH                            0x1
#define _CLKRCON_CLKRDIV1_MASK                              0x2
#define _CLKRCON_CLKRDIV2_POSN                              0x2
#define _CLKRCON_CLKRDIV2_POSITION                          0x2
#define _CLKRCON_CLKRDIV2_SIZE                              0x1
#define _CLKRCON_CLKRDIV2_LENGTH                            0x1
#define _CLKRCON_CLKRDIV2_MASK                              0x4
#define _CLKRCON_CLKRDC0_POSN                               0x3
#define _CLKRCON_CLKRDC0_POSITION                           0x3
#define _CLKRCON_CLKRDC0_SIZE                               0x1
#define _CLKRCON_CLKRDC0_LENGTH                             0x1
#define _CLKRCON_CLKRDC0_MASK                               0x8
#define _CLKRCON_CLKRDC1_POSN                               0x4
#define _CLKRCON_CLKRDC1_POSITION                           0x4
#define _CLKRCON_CLKRDC1_SIZE                               0x1
#define _CLKRCON_CLKRDC1_LENGTH                             0x1
#define _CLKRCON_CLKRDC1_MASK                               0x10
#define _CLKRCON_CLKRSLR_POSN                               0x5
#define _CLKRCON_CLKRSLR_POSITION                           0x5
#define _CLKRCON_CLKRSLR_SIZE                               0x1
#define _CLKRCON_CLKRSLR_LENGTH                             0x1
#define _CLKRCON_CLKRSLR_MASK                               0x20
#define _CLKRCON_CLKROE_POSN                                0x6
#define _CLKRCON_CLKROE_POSITION                            0x6
#define _CLKRCON_CLKROE_SIZE                                0x1
#define _CLKRCON_CLKROE_LENGTH                              0x1
#define _CLKRCON_CLKROE_MASK                                0x40
#define _CLKRCON_CLKREN_POSN                                0x7
#define _CLKRCON_CLKREN_POSITION                            0x7
#define _CLKRCON_CLKREN_SIZE                                0x1
#define _CLKRCON_CLKREN_LENGTH                              0x1
#define _CLKRCON_CLKREN_MASK                                0x80
#define _CLKRCON_CLKRDIV_POSN                               0x0
#define _CLKRCON_CLKRDIV_POSITION                           0x0
#define _CLKRCON_CLKRDIV_SIZE                               0x3
#define _CLKRCON_CLKRDIV_LENGTH                             0x3
#define _CLKRCON_CLKRDIV_MASK                               0x7
#define _CLKRCON_CLKRDC_POSN                                0x3
#define _CLKRCON_CLKRDC_POSITION                            0x3
#define _CLKRCON_CLKRDC_SIZE                                0x2
#define _CLKRCON_CLKRDC_LENGTH                              0x2
#define _CLKRCON_CLKRDC_MASK                                0x18

// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
extern volatile unsigned char           DAC2CON0            __at(0x591);
#ifndef _LIB_BUILD
asm("DAC2CON0 equ 0591h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned DAC2PSS                :2;
        unsigned DAC2OE2                :1;
        unsigned DAC2OE1                :1;
        unsigned                        :1;
        unsigned DAC2EN                 :1;
    };
} DAC2CON0bits_t;
extern volatile DAC2CON0bits_t DAC2CON0bits __at(0x591);
// bitfield macros
#define _DAC2CON0_DAC2PSS_POSN                              0x2
#define _DAC2CON0_DAC2PSS_POSITION                          0x2
#define _DAC2CON0_DAC2PSS_SIZE                              0x2
#define _DAC2CON0_DAC2PSS_LENGTH                            0x2
#define _DAC2CON0_DAC2PSS_MASK                              0xC
#define _DAC2CON0_DAC2OE2_POSN                              0x4
#define _DAC2CON0_DAC2OE2_POSITION                          0x4
#define _DAC2CON0_DAC2OE2_SIZE                              0x1
#define _DAC2CON0_DAC2OE2_LENGTH                            0x1
#define _DAC2CON0_DAC2OE2_MASK                              0x10
#define _DAC2CON0_DAC2OE1_POSN                              0x5
#define _DAC2CON0_DAC2OE1_POSITION                          0x5
#define _DAC2CON0_DAC2OE1_SIZE                              0x1
#define _DAC2CON0_DAC2OE1_LENGTH                            0x1
#define _DAC2CON0_DAC2OE1_MASK                              0x20
#define _DAC2CON0_DAC2EN_POSN                               0x7
#define _DAC2CON0_DAC2EN_POSITION                           0x7
#define _DAC2CON0_DAC2EN_SIZE                               0x1
#define _DAC2CON0_DAC2EN_LENGTH                             0x1
#define _DAC2CON0_DAC2EN_MASK                               0x80

// Register: DAC2REF
#define DAC2REF DAC2REF
extern volatile unsigned char           DAC2REF             __at(0x592);
#ifndef _LIB_BUILD
asm("DAC2REF equ 0592h");
#endif
// aliases
extern volatile unsigned char           DAC2CON1            __at(0x592);
#ifndef _LIB_BUILD
asm("DAC2CON1 equ 0592h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC2R                  :5;
    };
} DAC2REFbits_t;
extern volatile DAC2REFbits_t DAC2REFbits __at(0x592);
// bitfield macros
#define _DAC2REF_DAC2R_POSN                                 0x0
#define _DAC2REF_DAC2R_POSITION                             0x0
#define _DAC2REF_DAC2R_SIZE                                 0x5
#define _DAC2REF_DAC2R_LENGTH                               0x5
#define _DAC2REF_DAC2R_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned DAC2R                  :5;
    };
} DAC2CON1bits_t;
extern volatile DAC2CON1bits_t DAC2CON1bits __at(0x592);
// bitfield macros
#define _DAC2CON1_DAC2R_POSN                                0x0
#define _DAC2CON1_DAC2R_POSITION                            0x0
#define _DAC2CON1_DAC2R_SIZE                                0x5
#define _DAC2CON1_DAC2R_LENGTH                              0x5
#define _DAC2CON1_DAC2R_MASK                                0x1F

// Register: DAC3CON0
#define DAC3CON0 DAC3CON0
extern volatile unsigned char           DAC3CON0            __at(0x593);
#ifndef _LIB_BUILD
asm("DAC3CON0 equ 0593h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned DAC3PSS                :2;
        unsigned DAC3OE2                :1;
        unsigned DAC3OE1                :1;
        unsigned                        :1;
        unsigned DAC3EN                 :1;
    };
} DAC3CON0bits_t;
extern volatile DAC3CON0bits_t DAC3CON0bits __at(0x593);
// bitfield macros
#define _DAC3CON0_DAC3PSS_POSN                              0x2
#define _DAC3CON0_DAC3PSS_POSITION                          0x2
#define _DAC3CON0_DAC3PSS_SIZE                              0x2
#define _DAC3CON0_DAC3PSS_LENGTH                            0x2
#define _DAC3CON0_DAC3PSS_MASK                              0xC
#define _DAC3CON0_DAC3OE2_POSN                              0x4
#define _DAC3CON0_DAC3OE2_POSITION                          0x4
#define _DAC3CON0_DAC3OE2_SIZE                              0x1
#define _DAC3CON0_DAC3OE2_LENGTH                            0x1
#define _DAC3CON0_DAC3OE2_MASK                              0x10
#define _DAC3CON0_DAC3OE1_POSN                              0x5
#define _DAC3CON0_DAC3OE1_POSITION                          0x5
#define _DAC3CON0_DAC3OE1_SIZE                              0x1
#define _DAC3CON0_DAC3OE1_LENGTH                            0x1
#define _DAC3CON0_DAC3OE1_MASK                              0x20
#define _DAC3CON0_DAC3EN_POSN                               0x7
#define _DAC3CON0_DAC3EN_POSITION                           0x7
#define _DAC3CON0_DAC3EN_SIZE                               0x1
#define _DAC3CON0_DAC3EN_LENGTH                             0x1
#define _DAC3CON0_DAC3EN_MASK                               0x80

