MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
// Register: DAC3REF
#define DAC3REF DAC3REF
extern volatile unsigned char           DAC3REF             __at(0x594);
#ifndef _LIB_BUILD
asm("DAC3REF equ 0594h");
#endif
// aliases
extern volatile unsigned char           DAC3CON1            __at(0x594);
#ifndef _LIB_BUILD
asm("DAC3CON1 equ 0594h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC3R                  :5;
    };
} DAC3REFbits_t;
extern volatile DAC3REFbits_t DAC3REFbits __at(0x594);
// bitfield macros
#define _DAC3REF_DAC3R_POSN                                 0x0
#define _DAC3REF_DAC3R_POSITION                             0x0
#define _DAC3REF_DAC3R_SIZE                                 0x5
#define _DAC3REF_DAC3R_LENGTH                               0x5
#define _DAC3REF_DAC3R_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned DAC3R                  :5;
    };
} DAC3CON1bits_t;
extern volatile DAC3CON1bits_t DAC3CON1bits __at(0x594);
// bitfield macros
#define _DAC3CON1_DAC3R_POSN                                0x0
#define _DAC3CON1_DAC3R_POSITION                            0x0
#define _DAC3CON1_DAC3R_SIZE                                0x5
#define _DAC3CON1_DAC3R_LENGTH                              0x5
#define _DAC3CON1_DAC3R_MASK                                0x1F

// Register: DAC4CON0
#define DAC4CON0 DAC4CON0
extern volatile unsigned char           DAC4CON0            __at(0x595);
#ifndef _LIB_BUILD
asm("DAC4CON0 equ 0595h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned DAC4PSS                :2;
        unsigned DAC4OE2                :1;
        unsigned DAC4OE1                :1;
        unsigned                        :1;
        unsigned DAC4EN                 :1;
    };
} DAC4CON0bits_t;
extern volatile DAC4CON0bits_t DAC4CON0bits __at(0x595);
// bitfield macros
#define _DAC4CON0_DAC4PSS_POSN                              0x2
#define _DAC4CON0_DAC4PSS_POSITION                          0x2
#define _DAC4CON0_DAC4PSS_SIZE                              0x2
#define _DAC4CON0_DAC4PSS_LENGTH                            0x2
#define _DAC4CON0_DAC4PSS_MASK                              0xC
#define _DAC4CON0_DAC4OE2_POSN                              0x4
#define _DAC4CON0_DAC4OE2_POSITION                          0x4
#define _DAC4CON0_DAC4OE2_SIZE                              0x1
#define _DAC4CON0_DAC4OE2_LENGTH                            0x1
#define _DAC4CON0_DAC4OE2_MASK                              0x10
#define _DAC4CON0_DAC4OE1_POSN                              0x5
#define _DAC4CON0_DAC4OE1_POSITION                          0x5
#define _DAC4CON0_DAC4OE1_SIZE                              0x1
#define _DAC4CON0_DAC4OE1_LENGTH                            0x1
#define _DAC4CON0_DAC4OE1_MASK                              0x20
#define _DAC4CON0_DAC4EN_POSN                               0x7
#define _DAC4CON0_DAC4EN_POSITION                           0x7
#define _DAC4CON0_DAC4EN_SIZE                               0x1
#define _DAC4CON0_DAC4EN_LENGTH                             0x1
#define _DAC4CON0_DAC4EN_MASK                               0x80

// Register: DAC4REF
#define DAC4REF DAC4REF
extern volatile unsigned char           DAC4REF             __at(0x596);
#ifndef _LIB_BUILD
asm("DAC4REF equ 0596h");
#endif
// aliases
extern volatile unsigned char           DAC4CON1            __at(0x596);
#ifndef _LIB_BUILD
asm("DAC4CON1 equ 0596h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC4R                  :5;
    };
} DAC4REFbits_t;
extern volatile DAC4REFbits_t DAC4REFbits __at(0x596);
// bitfield macros
#define _DAC4REF_DAC4R_POSN                                 0x0
#define _DAC4REF_DAC4R_POSITION                             0x0
#define _DAC4REF_DAC4R_SIZE                                 0x5
#define _DAC4REF_DAC4R_LENGTH                               0x5
#define _DAC4REF_DAC4R_MASK                                 0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned DAC4R                  :5;
    };
} DAC4CON1bits_t;
extern volatile DAC4CON1bits_t DAC4CON1bits __at(0x596);
// bitfield macros
#define _DAC4CON1_DAC4R_POSN                                0x0
#define _DAC4CON1_DAC4R_POSITION                            0x0
#define _DAC4CON1_DAC4R_SIZE                                0x5
#define _DAC4CON1_DAC4R_LENGTH                              0x5
#define _DAC4CON1_DAC4R_MASK                                0x1F

// Register: PSMC1CON
#define PSMC1CON PSMC1CON
extern volatile unsigned char           PSMC1CON            __at(0xE91);
#ifndef _LIB_BUILD
asm("PSMC1CON equ 0E91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1MODE                 :4;
        unsigned P1DBRE                 :1;
        unsigned P1DBFE                 :1;
        unsigned PSMC1LD                :1;
        unsigned PSMC1EN                :1;
    };
    struct {
        unsigned P1MODE0                :1;
        unsigned P1MODE1                :1;
        unsigned P1MODE2                :1;
        unsigned P1MODE3                :1;
    };
} PSMC1CONbits_t;
extern volatile PSMC1CONbits_t PSMC1CONbits __at(0xE91);
// bitfield macros
#define _PSMC1CON_P1MODE_POSN                               0x0
#define _PSMC1CON_P1MODE_POSITION                           0x0
#define _PSMC1CON_P1MODE_SIZE                               0x4
#define _PSMC1CON_P1MODE_LENGTH                             0x4
#define _PSMC1CON_P1MODE_MASK                               0xF
#define _PSMC1CON_P1DBRE_POSN                               0x4
#define _PSMC1CON_P1DBRE_POSITION                           0x4
#define _PSMC1CON_P1DBRE_SIZE                               0x1
#define _PSMC1CON_P1DBRE_LENGTH                             0x1
#define _PSMC1CON_P1DBRE_MASK                               0x10
#define _PSMC1CON_P1DBFE_POSN                               0x5
#define _PSMC1CON_P1DBFE_POSITION                           0x5
#define _PSMC1CON_P1DBFE_SIZE                               0x1
#define _PSMC1CON_P1DBFE_LENGTH                             0x1
#define _PSMC1CON_P1DBFE_MASK                               0x20
#define _PSMC1CON_PSMC1LD_POSN                              0x6
#define _PSMC1CON_PSMC1LD_POSITION                          0x6
#define _PSMC1CON_PSMC1LD_SIZE                              0x1
#define _PSMC1CON_PSMC1LD_LENGTH                            0x1
#define _PSMC1CON_PSMC1LD_MASK                              0x40
#define _PSMC1CON_PSMC1EN_POSN                              0x7
#define _PSMC1CON_PSMC1EN_POSITION                          0x7
#define _PSMC1CON_PSMC1EN_SIZE                              0x1
#define _PSMC1CON_PSMC1EN_LENGTH                            0x1
#define _PSMC1CON_PSMC1EN_MASK                              0x80
#define _PSMC1CON_P1MODE0_POSN                              0x0
#define _PSMC1CON_P1MODE0_POSITION                          0x0
#define _PSMC1CON_P1MODE0_SIZE                              0x1
#define _PSMC1CON_P1MODE0_LENGTH                            0x1
#define _PSMC1CON_P1MODE0_MASK                              0x1
#define _PSMC1CON_P1MODE1_POSN                              0x1
#define _PSMC1CON_P1MODE1_POSITION                          0x1
#define _PSMC1CON_P1MODE1_SIZE                              0x1
#define _PSMC1CON_P1MODE1_LENGTH                            0x1
#define _PSMC1CON_P1MODE1_MASK                              0x2
#define _PSMC1CON_P1MODE2_POSN                              0x2
#define _PSMC1CON_P1MODE2_POSITION                          0x2
#define _PSMC1CON_P1MODE2_SIZE                              0x1
#define _PSMC1CON_P1MODE2_LENGTH                            0x1
#define _PSMC1CON_P1MODE2_MASK                              0x4
#define _PSMC1CON_P1MODE3_POSN                              0x3
#define _PSMC1CON_P1MODE3_POSITION                          0x3
#define _PSMC1CON_P1MODE3_SIZE                              0x1
#define _PSMC1CON_P1MODE3_LENGTH                            0x1
#define _PSMC1CON_P1MODE3_MASK                              0x8

// Register: PSMC1MDL
#define PSMC1MDL PSMC1MDL
extern volatile unsigned char           PSMC1MDL            __at(0xE92);
#ifndef _LIB_BUILD
asm("PSMC1MDL equ 0E92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1MSRC                 :4;
        unsigned                        :1;
        unsigned P1MDLBIT               :1;
        unsigned P1MDLPOL               :1;
        unsigned P1MDLEN                :1;
    };
    struct {
        unsigned P1MSRC0                :1;
        unsigned P1MSRC1                :1;
        unsigned P1MSRC2                :1;
        unsigned P1MSRC3                :1;
    };
} PSMC1MDLbits_t;
