MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
// Register: PSMC1PR
#define PSMC1PR PSMC1PR
extern volatile unsigned short          PSMC1PR             __at(0xEA5);
#ifndef _LIB_BUILD
asm("PSMC1PR equ 0EA5h");
#endif

// Register: PSMC1PRL
#define PSMC1PRL PSMC1PRL
extern volatile unsigned char           PSMC1PRL            __at(0xEA5);
#ifndef _LIB_BUILD
asm("PSMC1PRL equ 0EA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1PR0               :1;
        unsigned PSMC1PR1               :1;
        unsigned PSMC1PR2               :1;
        unsigned PSMC1PR3               :1;
        unsigned PSMC1PR4               :1;
        unsigned PSMC1PR5               :1;
        unsigned PSMC1PR6               :1;
        unsigned PSMC1PR7               :1;
    };
} PSMC1PRLbits_t;
extern volatile PSMC1PRLbits_t PSMC1PRLbits __at(0xEA5);
// bitfield macros
#define _PSMC1PRL_PSMC1PR0_POSN                             0x0
#define _PSMC1PRL_PSMC1PR0_POSITION                         0x0
#define _PSMC1PRL_PSMC1PR0_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR0_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR0_MASK                             0x1
#define _PSMC1PRL_PSMC1PR1_POSN                             0x1
#define _PSMC1PRL_PSMC1PR1_POSITION                         0x1
#define _PSMC1PRL_PSMC1PR1_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR1_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR1_MASK                             0x2
#define _PSMC1PRL_PSMC1PR2_POSN                             0x2
#define _PSMC1PRL_PSMC1PR2_POSITION                         0x2
#define _PSMC1PRL_PSMC1PR2_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR2_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR2_MASK                             0x4
#define _PSMC1PRL_PSMC1PR3_POSN                             0x3
#define _PSMC1PRL_PSMC1PR3_POSITION                         0x3
#define _PSMC1PRL_PSMC1PR3_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR3_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR3_MASK                             0x8
#define _PSMC1PRL_PSMC1PR4_POSN                             0x4
#define _PSMC1PRL_PSMC1PR4_POSITION                         0x4
#define _PSMC1PRL_PSMC1PR4_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR4_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR4_MASK                             0x10
#define _PSMC1PRL_PSMC1PR5_POSN                             0x5
#define _PSMC1PRL_PSMC1PR5_POSITION                         0x5
#define _PSMC1PRL_PSMC1PR5_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR5_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR5_MASK                             0x20
#define _PSMC1PRL_PSMC1PR6_POSN                             0x6
#define _PSMC1PRL_PSMC1PR6_POSITION                         0x6
#define _PSMC1PRL_PSMC1PR6_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR6_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR6_MASK                             0x40
#define _PSMC1PRL_PSMC1PR7_POSN                             0x7
#define _PSMC1PRL_PSMC1PR7_POSITION                         0x7
#define _PSMC1PRL_PSMC1PR7_SIZE                             0x1
#define _PSMC1PRL_PSMC1PR7_LENGTH                           0x1
#define _PSMC1PRL_PSMC1PR7_MASK                             0x80

// Register: PSMC1PRH
#define PSMC1PRH PSMC1PRH
extern volatile unsigned char           PSMC1PRH            __at(0xEA6);
#ifndef _LIB_BUILD
asm("PSMC1PRH equ 0EA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1PR8               :1;
        unsigned PSMC1PR9               :1;
        unsigned PSMC1PR10              :1;
        unsigned PSMC1PR11              :1;
        unsigned PSMC1PR12              :1;
        unsigned PSMC1PR13              :1;
        unsigned PSMC1PR14              :1;
        unsigned PSMC1PR15              :1;
    };
} PSMC1PRHbits_t;
extern volatile PSMC1PRHbits_t PSMC1PRHbits __at(0xEA6);
// bitfield macros
#define _PSMC1PRH_PSMC1PR8_POSN                             0x0
#define _PSMC1PRH_PSMC1PR8_POSITION                         0x0
#define _PSMC1PRH_PSMC1PR8_SIZE                             0x1
#define _PSMC1PRH_PSMC1PR8_LENGTH                           0x1
#define _PSMC1PRH_PSMC1PR8_MASK                             0x1
#define _PSMC1PRH_PSMC1PR9_POSN                             0x1
#define _PSMC1PRH_PSMC1PR9_POSITION                         0x1
#define _PSMC1PRH_PSMC1PR9_SIZE                             0x1
#define _PSMC1PRH_PSMC1PR9_LENGTH                           0x1
#define _PSMC1PRH_PSMC1PR9_MASK                             0x2
#define _PSMC1PRH_PSMC1PR10_POSN                            0x2
#define _PSMC1PRH_PSMC1PR10_POSITION                        0x2
#define _PSMC1PRH_PSMC1PR10_SIZE                            0x1
#define _PSMC1PRH_PSMC1PR10_LENGTH                          0x1
#define _PSMC1PRH_PSMC1PR10_MASK                            0x4
#define _PSMC1PRH_PSMC1PR11_POSN                            0x3
#define _PSMC1PRH_PSMC1PR11_POSITION                        0x3
#define _PSMC1PRH_PSMC1PR11_SIZE                            0x1
#define _PSMC1PRH_PSMC1PR11_LENGTH                          0x1
#define _PSMC1PRH_PSMC1PR11_MASK                            0x8
#define _PSMC1PRH_PSMC1PR12_POSN                            0x4
#define _PSMC1PRH_PSMC1PR12_POSITION                        0x4
#define _PSMC1PRH_PSMC1PR12_SIZE                            0x1
#define _PSMC1PRH_PSMC1PR12_LENGTH                          0x1
#define _PSMC1PRH_PSMC1PR12_MASK                            0x10
#define _PSMC1PRH_PSMC1PR13_POSN                            0x5
#define _PSMC1PRH_PSMC1PR13_POSITION                        0x5
#define _PSMC1PRH_PSMC1PR13_SIZE                            0x1
#define _PSMC1PRH_PSMC1PR13_LENGTH                          0x1
#define _PSMC1PRH_PSMC1PR13_MASK                            0x20
#define _PSMC1PRH_PSMC1PR14_POSN                            0x6
#define _PSMC1PRH_PSMC1PR14_POSITION                        0x6
#define _PSMC1PRH_PSMC1PR14_SIZE                            0x1
#define _PSMC1PRH_PSMC1PR14_LENGTH                          0x1
#define _PSMC1PRH_PSMC1PR14_MASK                            0x40
#define _PSMC1PRH_PSMC1PR15_POSN                            0x7
#define _PSMC1PRH_PSMC1PR15_POSITION                        0x7
#define _PSMC1PRH_PSMC1PR15_SIZE                            0x1
#define _PSMC1PRH_PSMC1PR15_LENGTH                          0x1
#define _PSMC1PRH_PSMC1PR15_MASK                            0x80

// Register: PSMC1TMR
#define PSMC1TMR PSMC1TMR
extern volatile unsigned short          PSMC1TMR            __at(0xEA7);
#ifndef _LIB_BUILD
asm("PSMC1TMR equ 0EA7h");
#endif

// Register: PSMC1TMRL
#define PSMC1TMRL PSMC1TMRL
extern volatile unsigned char           PSMC1TMRL           __at(0xEA7);
#ifndef _LIB_BUILD
asm("PSMC1TMRL equ 0EA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1TMR0              :1;
        unsigned PSMC1TMR1              :1;
        unsigned PSMC1TMR2              :1;
        unsigned PSMC1TMR3              :1;
        unsigned PSMC1TMR4              :1;
        unsigned PSMC1TMR5              :1;
        unsigned PSMC1TMR6              :1;
        unsigned PSMC1TMR7              :1;
    };
} PSMC1TMRLbits_t;
extern volatile PSMC1TMRLbits_t PSMC1TMRLbits __at(0xEA7);
// bitfield macros
#define _PSMC1TMRL_PSMC1TMR0_POSN                           0x0
#define _PSMC1TMRL_PSMC1TMR0_POSITION                       0x0
#define _PSMC1TMRL_PSMC1TMR0_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR0_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR0_MASK                           0x1
#define _PSMC1TMRL_PSMC1TMR1_POSN                           0x1
#define _PSMC1TMRL_PSMC1TMR1_POSITION                       0x1
#define _PSMC1TMRL_PSMC1TMR1_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR1_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR1_MASK                           0x2
#define _PSMC1TMRL_PSMC1TMR2_POSN                           0x2
#define _PSMC1TMRL_PSMC1TMR2_POSITION                       0x2
#define _PSMC1TMRL_PSMC1TMR2_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR2_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR2_MASK                           0x4
#define _PSMC1TMRL_PSMC1TMR3_POSN                           0x3
#define _PSMC1TMRL_PSMC1TMR3_POSITION                       0x3
#define _PSMC1TMRL_PSMC1TMR3_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR3_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR3_MASK                           0x8
#define _PSMC1TMRL_PSMC1TMR4_POSN                           0x4
#define _PSMC1TMRL_PSMC1TMR4_POSITION                       0x4
#define _PSMC1TMRL_PSMC1TMR4_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR4_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR4_MASK                           0x10
#define _PSMC1TMRL_PSMC1TMR5_POSN                           0x5
#define _PSMC1TMRL_PSMC1TMR5_POSITION                       0x5
#define _PSMC1TMRL_PSMC1TMR5_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR5_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR5_MASK                           0x20
#define _PSMC1TMRL_PSMC1TMR6_POSN                           0x6
#define _PSMC1TMRL_PSMC1TMR6_POSITION                       0x6
#define _PSMC1TMRL_PSMC1TMR6_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR6_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR6_MASK                           0x40
#define _PSMC1TMRL_PSMC1TMR7_POSN                           0x7
#define _PSMC1TMRL_PSMC1TMR7_POSITION                       0x7
#define _PSMC1TMRL_PSMC1TMR7_SIZE                           0x1
#define _PSMC1TMRL_PSMC1TMR7_LENGTH                         0x1
#define _PSMC1TMRL_PSMC1TMR7_MASK                           0x80

// Register: PSMC1TMRH
#define PSMC1TMRH PSMC1TMRH
extern volatile unsigned char           PSMC1TMRH           __at(0xEA8);
#ifndef _LIB_BUILD
asm("PSMC1TMRH equ 0EA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1TMR8              :1;
        unsigned PSMC1TMR9              :1;
        unsigned PSMC1TMR10             :1;
        unsigned PSMC1TMR11             :1;
        unsigned PSMC1TMR12             :1;
        unsigned PSMC1TMR13             :1;
        unsigned PSMC1TMR14             :1;
        unsigned PSMC1TMR15             :1;
    };
} PSMC1TMRHbits_t;
extern volatile PSMC1TMRHbits_t PSMC1TMRHbits __at(0xEA8);
// bitfield macros
#define _PSMC1TMRH_PSMC1TMR8_POSN                           0x0
#define _PSMC1TMRH_PSMC1TMR8_POSITION                       0x0
#define _PSMC1TMRH_PSMC1TMR8_SIZE                           0x1
#define _PSMC1TMRH_PSMC1TMR8_LENGTH                         0x1
#define _PSMC1TMRH_PSMC1TMR8_MASK                           0x1
#define _PSMC1TMRH_PSMC1TMR9_POSN                           0x1
#define _PSMC1TMRH_PSMC1TMR9_POSITION                       0x1
#define _PSMC1TMRH_PSMC1TMR9_SIZE                           0x1
#define _PSMC1TMRH_PSMC1TMR9_LENGTH                         0x1
#define _PSMC1TMRH_PSMC1TMR9_MASK                           0x2
#define _PSMC1TMRH_PSMC1TMR10_POSN                          0x2
#define _PSMC1TMRH_PSMC1TMR10_POSITION                      0x2
#define _PSMC1TMRH_PSMC1TMR10_SIZE                          0x1
#define _PSMC1TMRH_PSMC1TMR10_LENGTH                        0x1
#define _PSMC1TMRH_PSMC1TMR10_MASK                          0x4
#define _PSMC1TMRH_PSMC1TMR11_POSN                          0x3
#define _PSMC1TMRH_PSMC1TMR11_POSITION                      0x3
#define _PSMC1TMRH_PSMC1TMR11_SIZE                          0x1
#define _PSMC1TMRH_PSMC1TMR11_LENGTH                        0x1
#define _PSMC1TMRH_PSMC1TMR11_MASK                          0x8
#define _PSMC1TMRH_PSMC1TMR12_POSN                          0x4
#define _PSMC1TMRH_PSMC1TMR12_POSITION                      0x4
#define _PSMC1TMRH_PSMC1TMR12_SIZE                          0x1
#define _PSMC1TMRH_PSMC1TMR12_LENGTH                        0x1
#define _PSMC1TMRH_PSMC1TMR12_MASK                          0x10
#define _PSMC1TMRH_PSMC1TMR13_POSN                          0x5
#define _PSMC1TMRH_PSMC1TMR13_POSITION                      0x5
#define _PSMC1TMRH_PSMC1TMR13_SIZE                          0x1
#define _PSMC1TMRH_PSMC1TMR13_LENGTH                        0x1
#define _PSMC1TMRH_PSMC1TMR13_MASK                          0x20
#define _PSMC1TMRH_PSMC1TMR14_POSN                          0x6
#define _PSMC1TMRH_PSMC1TMR14_POSITION                      0x6
#define _PSMC1TMRH_PSMC1TMR14_SIZE                          0x1
#define _PSMC1TMRH_PSMC1TMR14_LENGTH                        0x1
#define _PSMC1TMRH_PSMC1TMR14_MASK                          0x40
#define _PSMC1TMRH_PSMC1TMR15_POSN                          0x7
#define _PSMC1TMRH_PSMC1TMR15_POSITION                      0x7
#define _PSMC1TMRH_PSMC1TMR15_SIZE                          0x1
#define _PSMC1TMRH_PSMC1TMR15_LENGTH                        0x1
#define _PSMC1TMRH_PSMC1TMR15_MASK                          0x80

