MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
// Register: PSMC1DBR
#define PSMC1DBR PSMC1DBR
extern volatile unsigned char           PSMC1DBR            __at(0xEA9);
#ifndef _LIB_BUILD
asm("PSMC1DBR equ 0EA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1DBR0              :1;
        unsigned PSMC1DBR1              :1;
        unsigned PSMC1DBR2              :1;
        unsigned PSMC1DBR3              :1;
        unsigned PSMC1DBR4              :1;
        unsigned PSMC1DBR5              :1;
        unsigned PSMC1DBR6              :1;
        unsigned PSMC1DBR7              :1;
    };
} PSMC1DBRbits_t;
extern volatile PSMC1DBRbits_t PSMC1DBRbits __at(0xEA9);
// bitfield macros
#define _PSMC1DBR_PSMC1DBR0_POSN                            0x0
#define _PSMC1DBR_PSMC1DBR0_POSITION                        0x0
#define _PSMC1DBR_PSMC1DBR0_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR0_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR0_MASK                            0x1
#define _PSMC1DBR_PSMC1DBR1_POSN                            0x1
#define _PSMC1DBR_PSMC1DBR1_POSITION                        0x1
#define _PSMC1DBR_PSMC1DBR1_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR1_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR1_MASK                            0x2
#define _PSMC1DBR_PSMC1DBR2_POSN                            0x2
#define _PSMC1DBR_PSMC1DBR2_POSITION                        0x2
#define _PSMC1DBR_PSMC1DBR2_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR2_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR2_MASK                            0x4
#define _PSMC1DBR_PSMC1DBR3_POSN                            0x3
#define _PSMC1DBR_PSMC1DBR3_POSITION                        0x3
#define _PSMC1DBR_PSMC1DBR3_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR3_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR3_MASK                            0x8
#define _PSMC1DBR_PSMC1DBR4_POSN                            0x4
#define _PSMC1DBR_PSMC1DBR4_POSITION                        0x4
#define _PSMC1DBR_PSMC1DBR4_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR4_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR4_MASK                            0x10
#define _PSMC1DBR_PSMC1DBR5_POSN                            0x5
#define _PSMC1DBR_PSMC1DBR5_POSITION                        0x5
#define _PSMC1DBR_PSMC1DBR5_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR5_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR5_MASK                            0x20
#define _PSMC1DBR_PSMC1DBR6_POSN                            0x6
#define _PSMC1DBR_PSMC1DBR6_POSITION                        0x6
#define _PSMC1DBR_PSMC1DBR6_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR6_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR6_MASK                            0x40
#define _PSMC1DBR_PSMC1DBR7_POSN                            0x7
#define _PSMC1DBR_PSMC1DBR7_POSITION                        0x7
#define _PSMC1DBR_PSMC1DBR7_SIZE                            0x1
#define _PSMC1DBR_PSMC1DBR7_LENGTH                          0x1
#define _PSMC1DBR_PSMC1DBR7_MASK                            0x80

// Register: PSMC1DBF
#define PSMC1DBF PSMC1DBF
extern volatile unsigned char           PSMC1DBF            __at(0xEAA);
#ifndef _LIB_BUILD
asm("PSMC1DBF equ 0EAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1DBF0              :1;
        unsigned PSMC1DBF1              :1;
        unsigned PSMC1DBF2              :1;
        unsigned PSMC1DBF3              :1;
        unsigned PSMC1DBF4              :1;
        unsigned PSMC1DBF5              :1;
        unsigned PSMC1DBF6              :1;
        unsigned PSMC1DBF7              :1;
    };
} PSMC1DBFbits_t;
extern volatile PSMC1DBFbits_t PSMC1DBFbits __at(0xEAA);
// bitfield macros
#define _PSMC1DBF_PSMC1DBF0_POSN                            0x0
#define _PSMC1DBF_PSMC1DBF0_POSITION                        0x0
#define _PSMC1DBF_PSMC1DBF0_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF0_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF0_MASK                            0x1
#define _PSMC1DBF_PSMC1DBF1_POSN                            0x1
#define _PSMC1DBF_PSMC1DBF1_POSITION                        0x1
#define _PSMC1DBF_PSMC1DBF1_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF1_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF1_MASK                            0x2
#define _PSMC1DBF_PSMC1DBF2_POSN                            0x2
#define _PSMC1DBF_PSMC1DBF2_POSITION                        0x2
#define _PSMC1DBF_PSMC1DBF2_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF2_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF2_MASK                            0x4
#define _PSMC1DBF_PSMC1DBF3_POSN                            0x3
#define _PSMC1DBF_PSMC1DBF3_POSITION                        0x3
#define _PSMC1DBF_PSMC1DBF3_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF3_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF3_MASK                            0x8
#define _PSMC1DBF_PSMC1DBF4_POSN                            0x4
#define _PSMC1DBF_PSMC1DBF4_POSITION                        0x4
#define _PSMC1DBF_PSMC1DBF4_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF4_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF4_MASK                            0x10
#define _PSMC1DBF_PSMC1DBF5_POSN                            0x5
#define _PSMC1DBF_PSMC1DBF5_POSITION                        0x5
#define _PSMC1DBF_PSMC1DBF5_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF5_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF5_MASK                            0x20
#define _PSMC1DBF_PSMC1DBF6_POSN                            0x6
#define _PSMC1DBF_PSMC1DBF6_POSITION                        0x6
#define _PSMC1DBF_PSMC1DBF6_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF6_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF6_MASK                            0x40
#define _PSMC1DBF_PSMC1DBF7_POSN                            0x7
#define _PSMC1DBF_PSMC1DBF7_POSITION                        0x7
#define _PSMC1DBF_PSMC1DBF7_SIZE                            0x1
#define _PSMC1DBF_PSMC1DBF7_LENGTH                          0x1
#define _PSMC1DBF_PSMC1DBF7_MASK                            0x80

// Register: PSMC1BLKR
#define PSMC1BLKR PSMC1BLKR
extern volatile unsigned char           PSMC1BLKR           __at(0xEAB);
#ifndef _LIB_BUILD
asm("PSMC1BLKR equ 0EABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1BLKR0             :1;
        unsigned PSMC1BLKR1             :1;
        unsigned PSMC1BLKR2             :1;
        unsigned PSMC1BLKR3             :1;
        unsigned PSMC1BLKR4             :1;
        unsigned PSMC1BLKR5             :1;
        unsigned PSMC1BLKR6             :1;
        unsigned PSMC1BLKR7             :1;
    };
} PSMC1BLKRbits_t;
