MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
extern volatile PSMC3SYNCbits_t PSMC3SYNCbits __at(0xED3);
// bitfield macros
#define _PSMC3SYNC_P3SYNC0_POSN                             0x0
#define _PSMC3SYNC_P3SYNC0_POSITION                         0x0
#define _PSMC3SYNC_P3SYNC0_SIZE                             0x1
#define _PSMC3SYNC_P3SYNC0_LENGTH                           0x1
#define _PSMC3SYNC_P3SYNC0_MASK                             0x1
#define _PSMC3SYNC_P3SYNC1_POSN                             0x1
#define _PSMC3SYNC_P3SYNC1_POSITION                         0x1
#define _PSMC3SYNC_P3SYNC1_SIZE                             0x1
#define _PSMC3SYNC_P3SYNC1_LENGTH                           0x1
#define _PSMC3SYNC_P3SYNC1_MASK                             0x2
#define _PSMC3SYNC_P3SYNC2_POSN                             0x2
#define _PSMC3SYNC_P3SYNC2_POSITION                         0x2
#define _PSMC3SYNC_P3SYNC2_SIZE                             0x1
#define _PSMC3SYNC_P3SYNC2_LENGTH                           0x1
#define _PSMC3SYNC_P3SYNC2_MASK                             0x4
#define _PSMC3SYNC_P3DCPOL_POSN                             0x5
#define _PSMC3SYNC_P3DCPOL_POSITION                         0x5
#define _PSMC3SYNC_P3DCPOL_SIZE                             0x1
#define _PSMC3SYNC_P3DCPOL_LENGTH                           0x1
#define _PSMC3SYNC_P3DCPOL_MASK                             0x20
#define _PSMC3SYNC_P3PRPOL_POSN                             0x6
#define _PSMC3SYNC_P3PRPOL_POSITION                         0x6
#define _PSMC3SYNC_P3PRPOL_SIZE                             0x1
#define _PSMC3SYNC_P3PRPOL_LENGTH                           0x1
#define _PSMC3SYNC_P3PRPOL_MASK                             0x40
#define _PSMC3SYNC_P3POFST_POSN                             0x7
#define _PSMC3SYNC_P3POFST_POSITION                         0x7
#define _PSMC3SYNC_P3POFST_SIZE                             0x1
#define _PSMC3SYNC_P3POFST_LENGTH                           0x1
#define _PSMC3SYNC_P3POFST_MASK                             0x80

// Register: PSMC3CLK
#define PSMC3CLK PSMC3CLK
extern volatile unsigned char           PSMC3CLK            __at(0xED4);
#ifndef _LIB_BUILD
asm("PSMC3CLK equ 0ED4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3CSRC0                :1;
        unsigned P3CSRC1                :1;
        unsigned                        :2;
        unsigned P3CPRE0                :1;
        unsigned P3CPRE1                :1;
    };
    struct {
        unsigned P3CSRC                 :2;
        unsigned                        :2;
        unsigned P3CPRE                 :2;
    };
} PSMC3CLKbits_t;
extern volatile PSMC3CLKbits_t PSMC3CLKbits __at(0xED4);
// bitfield macros
#define _PSMC3CLK_P3CSRC0_POSN                              0x0
#define _PSMC3CLK_P3CSRC0_POSITION                          0x0
#define _PSMC3CLK_P3CSRC0_SIZE                              0x1
#define _PSMC3CLK_P3CSRC0_LENGTH                            0x1
#define _PSMC3CLK_P3CSRC0_MASK                              0x1
#define _PSMC3CLK_P3CSRC1_POSN                              0x1
#define _PSMC3CLK_P3CSRC1_POSITION                          0x1
#define _PSMC3CLK_P3CSRC1_SIZE                              0x1
#define _PSMC3CLK_P3CSRC1_LENGTH                            0x1
#define _PSMC3CLK_P3CSRC1_MASK                              0x2
#define _PSMC3CLK_P3CPRE0_POSN                              0x4
#define _PSMC3CLK_P3CPRE0_POSITION                          0x4
#define _PSMC3CLK_P3CPRE0_SIZE                              0x1
#define _PSMC3CLK_P3CPRE0_LENGTH                            0x1
#define _PSMC3CLK_P3CPRE0_MASK                              0x10
#define _PSMC3CLK_P3CPRE1_POSN                              0x5
#define _PSMC3CLK_P3CPRE1_POSITION                          0x5
#define _PSMC3CLK_P3CPRE1_SIZE                              0x1
#define _PSMC3CLK_P3CPRE1_LENGTH                            0x1
#define _PSMC3CLK_P3CPRE1_MASK                              0x20
#define _PSMC3CLK_P3CSRC_POSN                               0x0
#define _PSMC3CLK_P3CSRC_POSITION                           0x0
#define _PSMC3CLK_P3CSRC_SIZE                               0x2
#define _PSMC3CLK_P3CSRC_LENGTH                             0x2
#define _PSMC3CLK_P3CSRC_MASK                               0x3
#define _PSMC3CLK_P3CPRE_POSN                               0x4
#define _PSMC3CLK_P3CPRE_POSITION                           0x4
#define _PSMC3CLK_P3CPRE_SIZE                               0x2
#define _PSMC3CLK_P3CPRE_LENGTH                             0x2
#define _PSMC3CLK_P3CPRE_MASK                               0x30

// Register: PSMC3OEN
#define PSMC3OEN PSMC3OEN
extern volatile unsigned char           PSMC3OEN            __at(0xED5);
#ifndef _LIB_BUILD
asm("PSMC3OEN equ 0ED5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3OEA                  :1;
        unsigned P3OEB                  :1;
        unsigned P3OEC                  :1;
        unsigned P3OED                  :1;
        unsigned P3OEE                  :1;
        unsigned P3OEF                  :1;
    };
} PSMC3OENbits_t;
extern volatile PSMC3OENbits_t PSMC3OENbits __at(0xED5);
// bitfield macros
#define _PSMC3OEN_P3OEA_POSN                                0x0
#define _PSMC3OEN_P3OEA_POSITION                            0x0
#define _PSMC3OEN_P3OEA_SIZE                                0x1
#define _PSMC3OEN_P3OEA_LENGTH                              0x1
#define _PSMC3OEN_P3OEA_MASK                                0x1
#define _PSMC3OEN_P3OEB_POSN                                0x1
#define _PSMC3OEN_P3OEB_POSITION                            0x1
#define _PSMC3OEN_P3OEB_SIZE                                0x1
#define _PSMC3OEN_P3OEB_LENGTH                              0x1
#define _PSMC3OEN_P3OEB_MASK                                0x2
#define _PSMC3OEN_P3OEC_POSN                                0x2
#define _PSMC3OEN_P3OEC_POSITION                            0x2
#define _PSMC3OEN_P3OEC_SIZE                                0x1
#define _PSMC3OEN_P3OEC_LENGTH                              0x1
#define _PSMC3OEN_P3OEC_MASK                                0x4
#define _PSMC3OEN_P3OED_POSN                                0x3
#define _PSMC3OEN_P3OED_POSITION                            0x3
#define _PSMC3OEN_P3OED_SIZE                                0x1
#define _PSMC3OEN_P3OED_LENGTH                              0x1
#define _PSMC3OEN_P3OED_MASK                                0x8
#define _PSMC3OEN_P3OEE_POSN                                0x4
#define _PSMC3OEN_P3OEE_POSITION                            0x4
#define _PSMC3OEN_P3OEE_SIZE                                0x1
#define _PSMC3OEN_P3OEE_LENGTH                              0x1
#define _PSMC3OEN_P3OEE_MASK                                0x10
#define _PSMC3OEN_P3OEF_POSN                                0x5
#define _PSMC3OEN_P3OEF_POSITION                            0x5
#define _PSMC3OEN_P3OEF_SIZE                                0x1
#define _PSMC3OEN_P3OEF_LENGTH                              0x1
#define _PSMC3OEN_P3OEF_MASK                                0x20

// Register: PSMC3POL
#define PSMC3POL PSMC3POL
extern volatile unsigned char           PSMC3POL            __at(0xED6);
#ifndef _LIB_BUILD
asm("PSMC3POL equ 0ED6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3POLA                 :1;
        unsigned P3POLB                 :1;
        unsigned P3POLC                 :1;
        unsigned P3POLD                 :1;
        unsigned P3POLE                 :1;
        unsigned P3POLF                 :1;
        unsigned P3INPOL                :1;
    };
} PSMC3POLbits_t;
