MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
#define                                 P2FEBSC1_bit        _BIT_ACCESS(PSMC2FEBS,1)
// PSMC2FEBS<P2FEBSC2>
extern volatile __bit                   P2FEBSC2            __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 P2FEBSC2_bit        _BIT_ACCESS(PSMC2FEBS,2)
// PSMC2FEBS<P2FEBSC3>
extern volatile __bit                   P2FEBSC3            __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 P2FEBSC3_bit        _BIT_ACCESS(PSMC2FEBS,3)
// PSMC2FEBS<P2FEBSC4>
extern volatile __bit                   P2FEBSC4            __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 P2FEBSC4_bit        _BIT_ACCESS(PSMC2FEBS,4)
// PSMC2FEBS<P2FEBSIN>
extern volatile __bit                   P2FEBSIN            __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 P2FEBSIN_bit        _BIT_ACCESS(PSMC2FEBS,7)
// PSMC2STR1<P2HSMEN>
extern volatile __bit                   P2HSMEN             __at(0x7678);	// @ (0xECF * 8 + 0)
#define                                 P2HSMEN_bit         _BIT_ACCESS(PSMC2STR1,0)
// PSMC2POL<P2INPOL>
extern volatile __bit                   P2INPOL             __at(0x75B6);	// @ (0xEB6 * 8 + 6)
#define                                 P2INPOL_bit         _BIT_ACCESS(PSMC2POL,6)
// PSMC2STR1<P2LSMEN>
extern volatile __bit                   P2LSMEN             __at(0x7679);	// @ (0xECF * 8 + 1)
#define                                 P2LSMEN_bit         _BIT_ACCESS(PSMC2STR1,1)
// PSMC2MDL<P2MDLBIT>
extern volatile __bit                   P2MDLBIT            __at(0x7595);	// @ (0xEB2 * 8 + 5)
#define                                 P2MDLBIT_bit        _BIT_ACCESS(PSMC2MDL,5)
// PSMC2MDL<P2MDLEN>
extern volatile __bit                   P2MDLEN             __at(0x7597);	// @ (0xEB2 * 8 + 7)
#define                                 P2MDLEN_bit         _BIT_ACCESS(PSMC2MDL,7)
// PSMC2MDL<P2MDLPOL>
extern volatile __bit                   P2MDLPOL            __at(0x7596);	// @ (0xEB2 * 8 + 6)
#define                                 P2MDLPOL_bit        _BIT_ACCESS(PSMC2MDL,6)
// PSMC2CON<P2MODE0>
extern volatile __bit                   P2MODE0             __at(0x7588);	// @ (0xEB1 * 8 + 0)
#define                                 P2MODE0_bit         _BIT_ACCESS(PSMC2CON,0)
// PSMC2CON<P2MODE1>
extern volatile __bit                   P2MODE1             __at(0x7589);	// @ (0xEB1 * 8 + 1)
#define                                 P2MODE1_bit         _BIT_ACCESS(PSMC2CON,1)
// PSMC2CON<P2MODE2>
extern volatile __bit                   P2MODE2             __at(0x758A);	// @ (0xEB1 * 8 + 2)
#define                                 P2MODE2_bit         _BIT_ACCESS(PSMC2CON,2)
// PSMC2CON<P2MODE3>
extern volatile __bit                   P2MODE3             __at(0x758B);	// @ (0xEB1 * 8 + 3)
#define                                 P2MODE3_bit         _BIT_ACCESS(PSMC2CON,3)
// PSMC2MDL<P2MSRC0>
extern volatile __bit                   P2MSRC0             __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 P2MSRC0_bit         _BIT_ACCESS(PSMC2MDL,0)
// PSMC2MDL<P2MSRC1>
extern volatile __bit                   P2MSRC1             __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 P2MSRC1_bit         _BIT_ACCESS(PSMC2MDL,1)
// PSMC2MDL<P2MSRC2>
extern volatile __bit                   P2MSRC2             __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 P2MSRC2_bit         _BIT_ACCESS(PSMC2MDL,2)
// PSMC2MDL<P2MSRC3>
extern volatile __bit                   P2MSRC3             __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 P2MSRC3_bit         _BIT_ACCESS(PSMC2MDL,3)
// PSMC2OEN<P2OEA>
extern volatile __bit                   P2OEA               __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 P2OEA_bit           _BIT_ACCESS(PSMC2OEN,0)
// PSMC2OEN<P2OEB>
extern volatile __bit                   P2OEB               __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 P2OEB_bit           _BIT_ACCESS(PSMC2OEN,1)
// PSMC2PHS<P2PHSC1>
extern volatile __bit                   P2PHSC1             __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 P2PHSC1_bit         _BIT_ACCESS(PSMC2PHS,1)
// PSMC2PHS<P2PHSC2>
extern volatile __bit                   P2PHSC2             __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 P2PHSC2_bit         _BIT_ACCESS(PSMC2PHS,2)
// PSMC2PHS<P2PHSC3>
extern volatile __bit                   P2PHSC3             __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 P2PHSC3_bit         _BIT_ACCESS(PSMC2PHS,3)
// PSMC2PHS<P2PHSC4>
extern volatile __bit                   P2PHSC4             __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 P2PHSC4_bit         _BIT_ACCESS(PSMC2PHS,4)
// PSMC2PHS<P2PHSIN>
extern volatile __bit                   P2PHSIN             __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 P2PHSIN_bit         _BIT_ACCESS(PSMC2PHS,7)
// PSMC2PHS<P2PHST>
extern volatile __bit                   P2PHST              __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 P2PHST_bit          _BIT_ACCESS(PSMC2PHS,0)
// PSMC2SYNC<P2POFST>
extern volatile __bit                   P2POFST             __at(0x759F);	// @ (0xEB3 * 8 + 7)
#define                                 P2POFST_bit         _BIT_ACCESS(PSMC2SYNC,7)
// PSMC2POL<P2POLA>
extern volatile __bit                   P2POLA              __at(0x75B0);	// @ (0xEB6 * 8 + 0)
#define                                 P2POLA_bit          _BIT_ACCESS(PSMC2POL,0)
// PSMC2POL<P2POLB>
extern volatile __bit                   P2POLB              __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 P2POLB_bit          _BIT_ACCESS(PSMC2POL,1)
// PSMC2SYNC<P2PRPOL>
extern volatile __bit                   P2PRPOL             __at(0x759E);	// @ (0xEB3 * 8 + 6)
#define                                 P2PRPOL_bit         _BIT_ACCESS(PSMC2SYNC,6)
// PSMC2PRS<P2PRSC1>
extern volatile __bit                   P2PRSC1             __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 P2PRSC1_bit         _BIT_ACCESS(PSMC2PRS,1)
// PSMC2PRS<P2PRSC2>
extern volatile __bit                   P2PRSC2             __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 P2PRSC2_bit         _BIT_ACCESS(PSMC2PRS,2)
// PSMC2PRS<P2PRSC3>
extern volatile __bit                   P2PRSC3             __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 P2PRSC3_bit         _BIT_ACCESS(PSMC2PRS,3)
// PSMC2PRS<P2PRSC4>
extern volatile __bit                   P2PRSC4             __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 P2PRSC4_bit         _BIT_ACCESS(PSMC2PRS,4)
// PSMC2PRS<P2PRSIN>
extern volatile __bit                   P2PRSIN             __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 P2PRSIN_bit         _BIT_ACCESS(PSMC2PRS,7)
// PSMC2PRS<P2PRST>
extern volatile __bit                   P2PRST              __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 P2PRST_bit          _BIT_ACCESS(PSMC2PRS,0)
// PSMC2BLNK<P2REBM0>
extern volatile __bit                   P2REBM0             __at(0x75B8);	// @ (0xEB7 * 8 + 0)
#define                                 P2REBM0_bit         _BIT_ACCESS(PSMC2BLNK,0)
// PSMC2BLNK<P2REBM1>
extern volatile __bit                   P2REBM1             __at(0x75B9);	// @ (0xEB7 * 8 + 1)
#define                                 P2REBM1_bit         _BIT_ACCESS(PSMC2BLNK,1)
// PSMC2REBS<P2REBSC1>
extern volatile __bit                   P2REBSC1            __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 P2REBSC1_bit        _BIT_ACCESS(PSMC2REBS,1)
// PSMC2REBS<P2REBSC2>
extern volatile __bit                   P2REBSC2            __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 P2REBSC2_bit        _BIT_ACCESS(PSMC2REBS,2)
// PSMC2REBS<P2REBSC3>
extern volatile __bit                   P2REBSC3            __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 P2REBSC3_bit        _BIT_ACCESS(PSMC2REBS,3)
// PSMC2REBS<P2REBSC4>
extern volatile __bit                   P2REBSC4            __at(0x75C4);	// @ (0xEB8 * 8 + 4)
#define                                 P2REBSC4_bit        _BIT_ACCESS(PSMC2REBS,4)
// PSMC2REBS<P2REBSIN>
extern volatile __bit                   P2REBSIN            __at(0x75C7);	// @ (0xEB8 * 8 + 7)
#define                                 P2REBSIN_bit        _BIT_ACCESS(PSMC2REBS,7)
// PSMC2STR1<P2SSYNC>
extern volatile __bit                   P2SSYNC             __at(0x767F);	// @ (0xECF * 8 + 7)
#define                                 P2SSYNC_bit         _BIT_ACCESS(PSMC2STR1,7)
// PSMC2STR0<P2STRA>
extern volatile __bit                   P2STRA              __at(0x7670);	// @ (0xECE * 8 + 0)
#define                                 P2STRA_bit          _BIT_ACCESS(PSMC2STR0,0)
// PSMC2STR0<P2STRB>
extern volatile __bit                   P2STRB              __at(0x7671);	// @ (0xECE * 8 + 1)
#define                                 P2STRB_bit          _BIT_ACCESS(PSMC2STR0,1)
// PSMC2SYNC<P2SYNC0>
extern volatile __bit                   P2SYNC0             __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 P2SYNC0_bit         _BIT_ACCESS(PSMC2SYNC,0)
// PSMC2SYNC<P2SYNC1>
extern volatile __bit                   P2SYNC1             __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 P2SYNC1_bit         _BIT_ACCESS(PSMC2SYNC,1)
// PSMC2SYNC<P2SYNC2>
extern volatile __bit                   P2SYNC2             __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 P2SYNC2_bit         _BIT_ACCESS(PSMC2SYNC,2)
// PSMC2INT<P2TDCIE>
extern volatile __bit                   P2TDCIE             __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 P2TDCIE_bit         _BIT_ACCESS(PSMC2INT,5)
// PSMC2INT<P2TDCIF>
extern volatile __bit                   P2TDCIF             __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 P2TDCIF_bit         _BIT_ACCESS(PSMC2INT,1)
// PSMC2INT<P2TOVIE>
extern volatile __bit                   P2TOVIE             __at(0x7607);	// @ (0xEC0 * 8 + 7)
#define                                 P2TOVIE_bit         _BIT_ACCESS(PSMC2INT,7)
// PSMC2INT<P2TOVIF>
extern volatile __bit                   P2TOVIF             __at(0x7603);	// @ (0xEC0 * 8 + 3)
#define                                 P2TOVIF_bit         _BIT_ACCESS(PSMC2INT,3)
// PSMC2INT<P2TPHIE>
extern volatile __bit                   P2TPHIE             __at(0x7606);	// @ (0xEC0 * 8 + 6)
#define                                 P2TPHIE_bit         _BIT_ACCESS(PSMC2INT,6)
// PSMC2INT<P2TPHIF>
extern volatile __bit                   P2TPHIF             __at(0x7602);	// @ (0xEC0 * 8 + 2)
#define                                 P2TPHIF_bit         _BIT_ACCESS(PSMC2INT,2)
// PSMC2INT<P2TPRIE>
extern volatile __bit                   P2TPRIE             __at(0x7604);	// @ (0xEC0 * 8 + 4)
#define                                 P2TPRIE_bit         _BIT_ACCESS(PSMC2INT,4)
// PSMC2INT<P2TPRIF>
extern volatile __bit                   P2TPRIF             __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 P2TPRIF_bit         _BIT_ACCESS(PSMC2INT,0)
// PSMC3ASDC<P3ARSEN>
extern volatile __bit                   P3ARSEN             __at(0x76ED);	// @ (0xEDD * 8 + 5)
#define                                 P3ARSEN_bit         _BIT_ACCESS(PSMC3ASDC,5)
// PSMC3ASDC<P3ASDEN>
extern volatile __bit                   P3ASDEN             __at(0x76EE);	// @ (0xEDD * 8 + 6)
#define                                 P3ASDEN_bit         _BIT_ACCESS(PSMC3ASDC,6)
// PSMC3ASDL<P3ASDLA>
extern volatile __bit                   P3ASDLA             __at(0x76F0);	// @ (0xEDE * 8 + 0)
#define                                 P3ASDLA_bit         _BIT_ACCESS(PSMC3ASDL,0)
// PSMC3ASDL<P3ASDLB>
extern volatile __bit                   P3ASDLB             __at(0x76F1);	// @ (0xEDE * 8 + 1)
#define                                 P3ASDLB_bit         _BIT_ACCESS(PSMC3ASDL,1)
// PSMC3ASDL<P3ASDLC>
extern volatile __bit                   P3ASDLC             __at(0x76F2);	// @ (0xEDE * 8 + 2)
#define                                 P3ASDLC_bit         _BIT_ACCESS(PSMC3ASDL,2)
// PSMC3ASDL<P3ASDLD>
extern volatile __bit                   P3ASDLD             __at(0x76F3);	// @ (0xEDE * 8 + 3)
#define                                 P3ASDLD_bit         _BIT_ACCESS(PSMC3ASDL,3)
// PSMC3ASDL<P3ASDLE>
extern volatile __bit                   P3ASDLE             __at(0x76F4);	// @ (0xEDE * 8 + 4)
#define                                 P3ASDLE_bit         _BIT_ACCESS(PSMC3ASDL,4)
// PSMC3ASDL<P3ASDLF>
extern volatile __bit                   P3ASDLF             __at(0x76F5);	// @ (0xEDE * 8 + 5)
#define                                 P3ASDLF_bit         _BIT_ACCESS(PSMC3ASDL,5)
// PSMC3ASDC<P3ASDOV>
extern volatile __bit                   P3ASDOV             __at(0x76E8);	// @ (0xEDD * 8 + 0)
#define                                 P3ASDOV_bit         _BIT_ACCESS(PSMC3ASDC,0)
// PSMC3ASDS<P3ASDSC1>
extern volatile __bit                   P3ASDSC1            __at(0x76F9);	// @ (0xEDF * 8 + 1)
#define                                 P3ASDSC1_bit        _BIT_ACCESS(PSMC3ASDS,1)
// PSMC3ASDS<P3ASDSC2>
extern volatile __bit                   P3ASDSC2            __at(0x76FA);	// @ (0xEDF * 8 + 2)
#define                                 P3ASDSC2_bit        _BIT_ACCESS(PSMC3ASDS,2)
// PSMC3ASDS<P3ASDSC3>
extern volatile __bit                   P3ASDSC3            __at(0x76FB);	// @ (0xEDF * 8 + 3)
#define                                 P3ASDSC3_bit        _BIT_ACCESS(PSMC3ASDS,3)
// PSMC3ASDS<P3ASDSC4>
extern volatile __bit                   P3ASDSC4            __at(0x76FC);	// @ (0xEDF * 8 + 4)
#define                                 P3ASDSC4_bit        _BIT_ACCESS(PSMC3ASDS,4)
// PSMC3ASDS<P3ASDSIN>
extern volatile __bit                   P3ASDSIN            __at(0x76FF);	// @ (0xEDF * 8 + 7)
#define                                 P3ASDSIN_bit        _BIT_ACCESS(PSMC3ASDS,7)
// PSMC3ASDC<P3ASE>
extern volatile __bit                   P3ASE               __at(0x76EF);	// @ (0xEDD * 8 + 7)
#define                                 P3ASE_bit           _BIT_ACCESS(PSMC3ASDC,7)
// PSMC3CLK<P3CPRE0>
extern volatile __bit                   P3CPRE0             __at(0x76A4);	// @ (0xED4 * 8 + 4)
#define                                 P3CPRE0_bit         _BIT_ACCESS(PSMC3CLK,4)
// PSMC3CLK<P3CPRE1>
extern volatile __bit                   P3CPRE1             __at(0x76A5);	// @ (0xED4 * 8 + 5)
#define                                 P3CPRE1_bit         _BIT_ACCESS(PSMC3CLK,5)
// PSMC3CLK<P3CSRC0>
extern volatile __bit                   P3CSRC0             __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 P3CSRC0_bit         _BIT_ACCESS(PSMC3CLK,0)
// PSMC3CLK<P3CSRC1>
extern volatile __bit                   P3CSRC1             __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 P3CSRC1_bit         _BIT_ACCESS(PSMC3CLK,1)
// PSMC3CON<P3DBFE>
extern volatile __bit                   P3DBFE              __at(0x768D);	// @ (0xED1 * 8 + 5)
#define                                 P3DBFE_bit          _BIT_ACCESS(PSMC3CON,5)
// PSMC3CON<P3DBRE>
extern volatile __bit                   P3DBRE              __at(0x768C);	// @ (0xED1 * 8 + 4)
#define                                 P3DBRE_bit          _BIT_ACCESS(PSMC3CON,4)
// PSMC3SYNC<P3DCPOL>
extern volatile __bit                   P3DCPOL             __at(0x769D);	// @ (0xED3 * 8 + 5)
#define                                 P3DCPOL_bit         _BIT_ACCESS(PSMC3SYNC,5)
// PSMC3DCS<P3DCSC1>
extern volatile __bit                   P3DCSC1             __at(0x76D9);	// @ (0xEDB * 8 + 1)
#define                                 P3DCSC1_bit         _BIT_ACCESS(PSMC3DCS,1)
// PSMC3DCS<P3DCSC2>
extern volatile __bit                   P3DCSC2             __at(0x76DA);	// @ (0xEDB * 8 + 2)
#define                                 P3DCSC2_bit         _BIT_ACCESS(PSMC3DCS,2)
// PSMC3DCS<P3DCSC3>
extern volatile __bit                   P3DCSC3             __at(0x76DB);	// @ (0xEDB * 8 + 3)
#define                                 P3DCSC3_bit         _BIT_ACCESS(PSMC3DCS,3)
// PSMC3DCS<P3DCSC4>
extern volatile __bit                   P3DCSC4             __at(0x76DC);	// @ (0xEDB * 8 + 4)
#define                                 P3DCSC4_bit         _BIT_ACCESS(PSMC3DCS,4)
// PSMC3DCS<P3DCSIN>
extern volatile __bit                   P3DCSIN             __at(0x76DF);	// @ (0xEDB * 8 + 7)
#define                                 P3DCSIN_bit         _BIT_ACCESS(PSMC3DCS,7)
// PSMC3DCS<P3DCST>
extern volatile __bit                   P3DCST              __at(0x76D8);	// @ (0xEDB * 8 + 0)
#define                                 P3DCST_bit          _BIT_ACCESS(PSMC3DCS,0)
// PSMC3BLNK<P3FEBM0>
extern volatile __bit                   P3FEBM0             __at(0x76BC);	// @ (0xED7 * 8 + 4)
#define                                 P3FEBM0_bit         _BIT_ACCESS(PSMC3BLNK,4)
// PSMC3BLNK<P3FEBM1>
extern volatile __bit                   P3FEBM1             __at(0x76BD);	// @ (0xED7 * 8 + 5)
#define                                 P3FEBM1_bit         _BIT_ACCESS(PSMC3BLNK,5)
// PSMC3FEBS<P3FEBSC1>
extern volatile __bit                   P3FEBSC1            __at(0x76C9);	// @ (0xED9 * 8 + 1)
#define                                 P3FEBSC1_bit        _BIT_ACCESS(PSMC3FEBS,1)
// PSMC3FEBS<P3FEBSC2>
extern volatile __bit                   P3FEBSC2            __at(0x76CA);	// @ (0xED9 * 8 + 2)
#define                                 P3FEBSC2_bit        _BIT_ACCESS(PSMC3FEBS,2)
// PSMC3FEBS<P3FEBSC3>
extern volatile __bit                   P3FEBSC3            __at(0x76CB);	// @ (0xED9 * 8 + 3)
#define                                 P3FEBSC3_bit        _BIT_ACCESS(PSMC3FEBS,3)
// PSMC3FEBS<P3FEBSC4>
extern volatile __bit                   P3FEBSC4            __at(0x76CC);	// @ (0xED9 * 8 + 4)
#define                                 P3FEBSC4_bit        _BIT_ACCESS(PSMC3FEBS,4)
// PSMC3FEBS<P3FEBSIN>
extern volatile __bit                   P3FEBSIN            __at(0x76CF);	// @ (0xED9 * 8 + 7)
#define                                 P3FEBSIN_bit        _BIT_ACCESS(PSMC3FEBS,7)
// PSMC3STR1<P3HSMEN>
extern volatile __bit                   P3HSMEN             __at(0x7778);	// @ (0xEEF * 8 + 0)
#define                                 P3HSMEN_bit         _BIT_ACCESS(PSMC3STR1,0)
// PSMC3POL<P3INPOL>
extern volatile __bit                   P3INPOL             __at(0x76B6);	// @ (0xED6 * 8 + 6)
#define                                 P3INPOL_bit         _BIT_ACCESS(PSMC3POL,6)
// PSMC3STR1<P3LSMEN>
extern volatile __bit                   P3LSMEN             __at(0x7779);	// @ (0xEEF * 8 + 1)
#define                                 P3LSMEN_bit         _BIT_ACCESS(PSMC3STR1,1)
// PSMC3MDL<P3MDLBIT>
extern volatile __bit                   P3MDLBIT            __at(0x7695);	// @ (0xED2 * 8 + 5)
#define                                 P3MDLBIT_bit        _BIT_ACCESS(PSMC3MDL,5)
// PSMC3MDL<P3MDLEN>
extern volatile __bit                   P3MDLEN             __at(0x7697);	// @ (0xED2 * 8 + 7)
#define                                 P3MDLEN_bit         _BIT_ACCESS(PSMC3MDL,7)
// PSMC3MDL<P3MDLPOL>
extern volatile __bit                   P3MDLPOL            __at(0x7696);	// @ (0xED2 * 8 + 6)
#define                                 P3MDLPOL_bit        _BIT_ACCESS(PSMC3MDL,6)
// PSMC3CON<P3MODE0>
extern volatile __bit                   P3MODE0             __at(0x7688);	// @ (0xED1 * 8 + 0)
#define                                 P3MODE0_bit         _BIT_ACCESS(PSMC3CON,0)
// PSMC3CON<P3MODE1>
extern volatile __bit                   P3MODE1             __at(0x7689);	// @ (0xED1 * 8 + 1)
#define                                 P3MODE1_bit         _BIT_ACCESS(PSMC3CON,1)
// PSMC3CON<P3MODE2>
extern volatile __bit                   P3MODE2             __at(0x768A);	// @ (0xED1 * 8 + 2)
#define                                 P3MODE2_bit         _BIT_ACCESS(PSMC3CON,2)
// PSMC3CON<P3MODE3>
extern volatile __bit                   P3MODE3             __at(0x768B);	// @ (0xED1 * 8 + 3)
#define                                 P3MODE3_bit         _BIT_ACCESS(PSMC3CON,3)
// PSMC3MDL<P3MSRC0>
extern volatile __bit                   P3MSRC0             __at(0x7690);	// @ (0xED2 * 8 + 0)
#define                                 P3MSRC0_bit         _BIT_ACCESS(PSMC3MDL,0)
// PSMC3MDL<P3MSRC1>
extern volatile __bit                   P3MSRC1             __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 P3MSRC1_bit         _BIT_ACCESS(PSMC3MDL,1)
// PSMC3MDL<P3MSRC2>
extern volatile __bit                   P3MSRC2             __at(0x7692);	// @ (0xED2 * 8 + 2)
#define                                 P3MSRC2_bit         _BIT_ACCESS(PSMC3MDL,2)
// PSMC3MDL<P3MSRC3>
extern volatile __bit                   P3MSRC3             __at(0x7693);	// @ (0xED2 * 8 + 3)
#define                                 P3MSRC3_bit         _BIT_ACCESS(PSMC3MDL,3)
// PSMC3OEN<P3OEA>
extern volatile __bit                   P3OEA               __at(0x76A8);	// @ (0xED5 * 8 + 0)
#define                                 P3OEA_bit           _BIT_ACCESS(PSMC3OEN,0)
// PSMC3OEN<P3OEB>
extern volatile __bit                   P3OEB               __at(0x76A9);	// @ (0xED5 * 8 + 1)
#define                                 P3OEB_bit           _BIT_ACCESS(PSMC3OEN,1)
// PSMC3OEN<P3OEC>
extern volatile __bit                   P3OEC               __at(0x76AA);	// @ (0xED5 * 8 + 2)
#define                                 P3OEC_bit           _BIT_ACCESS(PSMC3OEN,2)
// PSMC3OEN<P3OED>
extern volatile __bit                   P3OED               __at(0x76AB);	// @ (0xED5 * 8 + 3)
#define                                 P3OED_bit           _BIT_ACCESS(PSMC3OEN,3)
// PSMC3OEN<P3OEE>
extern volatile __bit                   P3OEE               __at(0x76AC);	// @ (0xED5 * 8 + 4)
#define                                 P3OEE_bit           _BIT_ACCESS(PSMC3OEN,4)
// PSMC3OEN<P3OEF>
extern volatile __bit                   P3OEF               __at(0x76AD);	// @ (0xED5 * 8 + 5)
#define                                 P3OEF_bit           _BIT_ACCESS(PSMC3OEN,5)
// PSMC3PHS<P3PHSC1>
extern volatile __bit                   P3PHSC1             __at(0x76D1);	// @ (0xEDA * 8 + 1)
#define                                 P3PHSC1_bit         _BIT_ACCESS(PSMC3PHS,1)
// PSMC3PHS<P3PHSC2>
extern volatile __bit                   P3PHSC2             __at(0x76D2);	// @ (0xEDA * 8 + 2)
#define                                 P3PHSC2_bit         _BIT_ACCESS(PSMC3PHS,2)
// PSMC3PHS<P3PHSC3>
extern volatile __bit                   P3PHSC3             __at(0x76D3);	// @ (0xEDA * 8 + 3)
#define                                 P3PHSC3_bit         _BIT_ACCESS(PSMC3PHS,3)
// PSMC3PHS<P3PHSC4>
extern volatile __bit                   P3PHSC4             __at(0x76D4);	// @ (0xEDA * 8 + 4)
#define                                 P3PHSC4_bit         _BIT_ACCESS(PSMC3PHS,4)
// PSMC3PHS<P3PHSIN>
extern volatile __bit                   P3PHSIN             __at(0x76D7);	// @ (0xEDA * 8 + 7)
#define                                 P3PHSIN_bit         _BIT_ACCESS(PSMC3PHS,7)
// PSMC3PHS<P3PHST>
extern volatile __bit                   P3PHST              __at(0x76D0);	// @ (0xEDA * 8 + 0)
#define                                 P3PHST_bit          _BIT_ACCESS(PSMC3PHS,0)
// PSMC3SYNC<P3POFST>
extern volatile __bit                   P3POFST             __at(0x769F);	// @ (0xED3 * 8 + 7)
#define                                 P3POFST_bit         _BIT_ACCESS(PSMC3SYNC,7)
// PSMC3POL<P3POLA>
