MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
#define                                 PSMC2BLKF1_bit      _BIT_ACCESS(PSMC2BLKF,1)
// PSMC2BLKF<PSMC2BLKF2>
extern volatile __bit                   PSMC2BLKF2          __at(0x7662);	// @ (0xECC * 8 + 2)
#define                                 PSMC2BLKF2_bit      _BIT_ACCESS(PSMC2BLKF,2)
// PSMC2BLKF<PSMC2BLKF3>
extern volatile __bit                   PSMC2BLKF3          __at(0x7663);	// @ (0xECC * 8 + 3)
#define                                 PSMC2BLKF3_bit      _BIT_ACCESS(PSMC2BLKF,3)
// PSMC2BLKF<PSMC2BLKF4>
extern volatile __bit                   PSMC2BLKF4          __at(0x7664);	// @ (0xECC * 8 + 4)
#define                                 PSMC2BLKF4_bit      _BIT_ACCESS(PSMC2BLKF,4)
// PSMC2BLKF<PSMC2BLKF5>
extern volatile __bit                   PSMC2BLKF5          __at(0x7665);	// @ (0xECC * 8 + 5)
#define                                 PSMC2BLKF5_bit      _BIT_ACCESS(PSMC2BLKF,5)
// PSMC2BLKF<PSMC2BLKF6>
extern volatile __bit                   PSMC2BLKF6          __at(0x7666);	// @ (0xECC * 8 + 6)
#define                                 PSMC2BLKF6_bit      _BIT_ACCESS(PSMC2BLKF,6)
// PSMC2BLKF<PSMC2BLKF7>
extern volatile __bit                   PSMC2BLKF7          __at(0x7667);	// @ (0xECC * 8 + 7)
#define                                 PSMC2BLKF7_bit      _BIT_ACCESS(PSMC2BLKF,7)
// PSMC2BLKR<PSMC2BLKR0>
extern volatile __bit                   PSMC2BLKR0          __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 PSMC2BLKR0_bit      _BIT_ACCESS(PSMC2BLKR,0)
// PSMC2BLKR<PSMC2BLKR1>
extern volatile __bit                   PSMC2BLKR1          __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 PSMC2BLKR1_bit      _BIT_ACCESS(PSMC2BLKR,1)
// PSMC2BLKR<PSMC2BLKR2>
extern volatile __bit                   PSMC2BLKR2          __at(0x765A);	// @ (0xECB * 8 + 2)
#define                                 PSMC2BLKR2_bit      _BIT_ACCESS(PSMC2BLKR,2)
// PSMC2BLKR<PSMC2BLKR3>
extern volatile __bit                   PSMC2BLKR3          __at(0x765B);	// @ (0xECB * 8 + 3)
#define                                 PSMC2BLKR3_bit      _BIT_ACCESS(PSMC2BLKR,3)
// PSMC2BLKR<PSMC2BLKR4>
extern volatile __bit                   PSMC2BLKR4          __at(0x765C);	// @ (0xECB * 8 + 4)
#define                                 PSMC2BLKR4_bit      _BIT_ACCESS(PSMC2BLKR,4)
// PSMC2BLKR<PSMC2BLKR5>
extern volatile __bit                   PSMC2BLKR5          __at(0x765D);	// @ (0xECB * 8 + 5)
#define                                 PSMC2BLKR5_bit      _BIT_ACCESS(PSMC2BLKR,5)
// PSMC2BLKR<PSMC2BLKR6>
extern volatile __bit                   PSMC2BLKR6          __at(0x765E);	// @ (0xECB * 8 + 6)
#define                                 PSMC2BLKR6_bit      _BIT_ACCESS(PSMC2BLKR,6)
// PSMC2BLKR<PSMC2BLKR7>
extern volatile __bit                   PSMC2BLKR7          __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 PSMC2BLKR7_bit      _BIT_ACCESS(PSMC2BLKR,7)
// PSMC2DBF<PSMC2DBF0>
extern volatile __bit                   PSMC2DBF0           __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 PSMC2DBF0_bit       _BIT_ACCESS(PSMC2DBF,0)
// PSMC2DBF<PSMC2DBF1>
extern volatile __bit                   PSMC2DBF1           __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 PSMC2DBF1_bit       _BIT_ACCESS(PSMC2DBF,1)
// PSMC2DBF<PSMC2DBF2>
extern volatile __bit                   PSMC2DBF2           __at(0x7652);	// @ (0xECA * 8 + 2)
#define                                 PSMC2DBF2_bit       _BIT_ACCESS(PSMC2DBF,2)
// PSMC2DBF<PSMC2DBF3>
extern volatile __bit                   PSMC2DBF3           __at(0x7653);	// @ (0xECA * 8 + 3)
#define                                 PSMC2DBF3_bit       _BIT_ACCESS(PSMC2DBF,3)
// PSMC2DBF<PSMC2DBF4>
extern volatile __bit                   PSMC2DBF4           __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 PSMC2DBF4_bit       _BIT_ACCESS(PSMC2DBF,4)
// PSMC2DBF<PSMC2DBF5>
extern volatile __bit                   PSMC2DBF5           __at(0x7655);	// @ (0xECA * 8 + 5)
#define                                 PSMC2DBF5_bit       _BIT_ACCESS(PSMC2DBF,5)
// PSMC2DBF<PSMC2DBF6>
extern volatile __bit                   PSMC2DBF6           __at(0x7656);	// @ (0xECA * 8 + 6)
#define                                 PSMC2DBF6_bit       _BIT_ACCESS(PSMC2DBF,6)
// PSMC2DBF<PSMC2DBF7>
extern volatile __bit                   PSMC2DBF7           __at(0x7657);	// @ (0xECA * 8 + 7)
#define                                 PSMC2DBF7_bit       _BIT_ACCESS(PSMC2DBF,7)
// PSMC2DBR<PSMC2DBR0>
extern volatile __bit                   PSMC2DBR0           __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 PSMC2DBR0_bit       _BIT_ACCESS(PSMC2DBR,0)
// PSMC2DBR<PSMC2DBR1>
extern volatile __bit                   PSMC2DBR1           __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 PSMC2DBR1_bit       _BIT_ACCESS(PSMC2DBR,1)
// PSMC2DBR<PSMC2DBR2>
extern volatile __bit                   PSMC2DBR2           __at(0x764A);	// @ (0xEC9 * 8 + 2)
#define                                 PSMC2DBR2_bit       _BIT_ACCESS(PSMC2DBR,2)
// PSMC2DBR<PSMC2DBR3>
extern volatile __bit                   PSMC2DBR3           __at(0x764B);	// @ (0xEC9 * 8 + 3)
#define                                 PSMC2DBR3_bit       _BIT_ACCESS(PSMC2DBR,3)
// PSMC2DBR<PSMC2DBR4>
extern volatile __bit                   PSMC2DBR4           __at(0x764C);	// @ (0xEC9 * 8 + 4)
#define                                 PSMC2DBR4_bit       _BIT_ACCESS(PSMC2DBR,4)
// PSMC2DBR<PSMC2DBR5>
extern volatile __bit                   PSMC2DBR5           __at(0x764D);	// @ (0xEC9 * 8 + 5)
#define                                 PSMC2DBR5_bit       _BIT_ACCESS(PSMC2DBR,5)
// PSMC2DBR<PSMC2DBR6>
extern volatile __bit                   PSMC2DBR6           __at(0x764E);	// @ (0xEC9 * 8 + 6)
#define                                 PSMC2DBR6_bit       _BIT_ACCESS(PSMC2DBR,6)
// PSMC2DBR<PSMC2DBR7>
extern volatile __bit                   PSMC2DBR7           __at(0x764F);	// @ (0xEC9 * 8 + 7)
#define                                 PSMC2DBR7_bit       _BIT_ACCESS(PSMC2DBR,7)
// PSMC2DCL<PSMC2DC0>
extern volatile __bit                   PSMC2DC0            __at(0x7618);	// @ (0xEC3 * 8 + 0)
#define                                 PSMC2DC0_bit        _BIT_ACCESS(PSMC2DCL,0)
// PSMC2DCL<PSMC2DC1>
extern volatile __bit                   PSMC2DC1            __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 PSMC2DC1_bit        _BIT_ACCESS(PSMC2DCL,1)
// PSMC2DCH<PSMC2DC10>
extern volatile __bit                   PSMC2DC10           __at(0x7622);	// @ (0xEC4 * 8 + 2)
#define                                 PSMC2DC10_bit       _BIT_ACCESS(PSMC2DCH,2)
// PSMC2DCH<PSMC2DC11>
extern volatile __bit                   PSMC2DC11           __at(0x7623);	// @ (0xEC4 * 8 + 3)
#define                                 PSMC2DC11_bit       _BIT_ACCESS(PSMC2DCH,3)
// PSMC2DCH<PSMC2DC12>
extern volatile __bit                   PSMC2DC12           __at(0x7624);	// @ (0xEC4 * 8 + 4)
#define                                 PSMC2DC12_bit       _BIT_ACCESS(PSMC2DCH,4)
// PSMC2DCH<PSMC2DC13>
extern volatile __bit                   PSMC2DC13           __at(0x7625);	// @ (0xEC4 * 8 + 5)
#define                                 PSMC2DC13_bit       _BIT_ACCESS(PSMC2DCH,5)
// PSMC2DCH<PSMC2DC14>
extern volatile __bit                   PSMC2DC14           __at(0x7626);	// @ (0xEC4 * 8 + 6)
#define                                 PSMC2DC14_bit       _BIT_ACCESS(PSMC2DCH,6)
// PSMC2DCH<PSMC2DC15>
extern volatile __bit                   PSMC2DC15           __at(0x7627);	// @ (0xEC4 * 8 + 7)
#define                                 PSMC2DC15_bit       _BIT_ACCESS(PSMC2DCH,7)
// PSMC2DCL<PSMC2DC2>
extern volatile __bit                   PSMC2DC2            __at(0x761A);	// @ (0xEC3 * 8 + 2)
#define                                 PSMC2DC2_bit        _BIT_ACCESS(PSMC2DCL,2)
// PSMC2DCL<PSMC2DC3>
extern volatile __bit                   PSMC2DC3            __at(0x761B);	// @ (0xEC3 * 8 + 3)
#define                                 PSMC2DC3_bit        _BIT_ACCESS(PSMC2DCL,3)
// PSMC2DCL<PSMC2DC4>
extern volatile __bit                   PSMC2DC4            __at(0x761C);	// @ (0xEC3 * 8 + 4)
#define                                 PSMC2DC4_bit        _BIT_ACCESS(PSMC2DCL,4)
// PSMC2DCL<PSMC2DC5>
extern volatile __bit                   PSMC2DC5            __at(0x761D);	// @ (0xEC3 * 8 + 5)
#define                                 PSMC2DC5_bit        _BIT_ACCESS(PSMC2DCL,5)
// PSMC2DCL<PSMC2DC6>
extern volatile __bit                   PSMC2DC6            __at(0x761E);	// @ (0xEC3 * 8 + 6)
#define                                 PSMC2DC6_bit        _BIT_ACCESS(PSMC2DCL,6)
// PSMC2DCL<PSMC2DC7>
extern volatile __bit                   PSMC2DC7            __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 PSMC2DC7_bit        _BIT_ACCESS(PSMC2DCL,7)
// PSMC2DCH<PSMC2DC8>
extern volatile __bit                   PSMC2DC8            __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 PSMC2DC8_bit        _BIT_ACCESS(PSMC2DCH,0)
// PSMC2DCH<PSMC2DC9>
extern volatile __bit                   PSMC2DC9            __at(0x7621);	// @ (0xEC4 * 8 + 1)
#define                                 PSMC2DC9_bit        _BIT_ACCESS(PSMC2DCH,1)
// PSMC2CON<PSMC2EN>
extern volatile __bit                   PSMC2EN             __at(0x758F);	// @ (0xEB1 * 8 + 7)
#define                                 PSMC2EN_bit         _BIT_ACCESS(PSMC2CON,7)
// PSMC2FFA<PSMC2FFA0>
extern volatile __bit                   PSMC2FFA0           __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 PSMC2FFA0_bit       _BIT_ACCESS(PSMC2FFA,0)
// PSMC2FFA<PSMC2FFA1>
extern volatile __bit                   PSMC2FFA1           __at(0x7669);	// @ (0xECD * 8 + 1)
#define                                 PSMC2FFA1_bit       _BIT_ACCESS(PSMC2FFA,1)
// PSMC2FFA<PSMC2FFA2>
extern volatile __bit                   PSMC2FFA2           __at(0x766A);	// @ (0xECD * 8 + 2)
#define                                 PSMC2FFA2_bit       _BIT_ACCESS(PSMC2FFA,2)
// PSMC2FFA<PSMC2FFA3>
extern volatile __bit                   PSMC2FFA3           __at(0x766B);	// @ (0xECD * 8 + 3)
#define                                 PSMC2FFA3_bit       _BIT_ACCESS(PSMC2FFA,3)
// PSMC2CON<PSMC2LD>
extern volatile __bit                   PSMC2LD             __at(0x758E);	// @ (0xEB1 * 8 + 6)
#define                                 PSMC2LD_bit         _BIT_ACCESS(PSMC2CON,6)
// PSMC2PHL<PSMC2PH0>
extern volatile __bit                   PSMC2PH0            __at(0x7608);	// @ (0xEC1 * 8 + 0)
#define                                 PSMC2PH0_bit        _BIT_ACCESS(PSMC2PHL,0)
// PSMC2PHL<PSMC2PH1>
extern volatile __bit                   PSMC2PH1            __at(0x7609);	// @ (0xEC1 * 8 + 1)
#define                                 PSMC2PH1_bit        _BIT_ACCESS(PSMC2PHL,1)
// PSMC2PHH<PSMC2PH10>
extern volatile __bit                   PSMC2PH10           __at(0x7612);	// @ (0xEC2 * 8 + 2)
#define                                 PSMC2PH10_bit       _BIT_ACCESS(PSMC2PHH,2)
// PSMC2PHH<PSMC2PH11>
extern volatile __bit                   PSMC2PH11           __at(0x7613);	// @ (0xEC2 * 8 + 3)
#define                                 PSMC2PH11_bit       _BIT_ACCESS(PSMC2PHH,3)
// PSMC2PHH<PSMC2PH12>
extern volatile __bit                   PSMC2PH12           __at(0x7614);	// @ (0xEC2 * 8 + 4)
#define                                 PSMC2PH12_bit       _BIT_ACCESS(PSMC2PHH,4)
// PSMC2PHH<PSMC2PH13>
extern volatile __bit                   PSMC2PH13           __at(0x7615);	// @ (0xEC2 * 8 + 5)
#define                                 PSMC2PH13_bit       _BIT_ACCESS(PSMC2PHH,5)
// PSMC2PHH<PSMC2PH14>
extern volatile __bit                   PSMC2PH14           __at(0x7616);	// @ (0xEC2 * 8 + 6)
#define                                 PSMC2PH14_bit       _BIT_ACCESS(PSMC2PHH,6)
// PSMC2PHH<PSMC2PH15>
extern volatile __bit                   PSMC2PH15           __at(0x7617);	// @ (0xEC2 * 8 + 7)
#define                                 PSMC2PH15_bit       _BIT_ACCESS(PSMC2PHH,7)
// PSMC2PHL<PSMC2PH2>
extern volatile __bit                   PSMC2PH2            __at(0x760A);	// @ (0xEC1 * 8 + 2)
#define                                 PSMC2PH2_bit        _BIT_ACCESS(PSMC2PHL,2)
// PSMC2PHL<PSMC2PH3>
extern volatile __bit                   PSMC2PH3            __at(0x760B);	// @ (0xEC1 * 8 + 3)
#define                                 PSMC2PH3_bit        _BIT_ACCESS(PSMC2PHL,3)
// PSMC2PHL<PSMC2PH4>
extern volatile __bit                   PSMC2PH4            __at(0x760C);	// @ (0xEC1 * 8 + 4)
#define                                 PSMC2PH4_bit        _BIT_ACCESS(PSMC2PHL,4)
// PSMC2PHL<PSMC2PH5>
extern volatile __bit                   PSMC2PH5            __at(0x760D);	// @ (0xEC1 * 8 + 5)
#define                                 PSMC2PH5_bit        _BIT_ACCESS(PSMC2PHL,5)
// PSMC2PHL<PSMC2PH6>
extern volatile __bit                   PSMC2PH6            __at(0x760E);	// @ (0xEC1 * 8 + 6)
#define                                 PSMC2PH6_bit        _BIT_ACCESS(PSMC2PHL,6)
// PSMC2PHL<PSMC2PH7>
extern volatile __bit                   PSMC2PH7            __at(0x760F);	// @ (0xEC1 * 8 + 7)
#define                                 PSMC2PH7_bit        _BIT_ACCESS(PSMC2PHL,7)
// PSMC2PHH<PSMC2PH8>
extern volatile __bit                   PSMC2PH8            __at(0x7610);	// @ (0xEC2 * 8 + 0)
#define                                 PSMC2PH8_bit        _BIT_ACCESS(PSMC2PHH,0)
// PSMC2PHH<PSMC2PH9>
extern volatile __bit                   PSMC2PH9            __at(0x7611);	// @ (0xEC2 * 8 + 1)
#define                                 PSMC2PH9_bit        _BIT_ACCESS(PSMC2PHH,1)
// PSMC2PRL<PSMC2PR0>
extern volatile __bit                   PSMC2PR0            __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 PSMC2PR0_bit        _BIT_ACCESS(PSMC2PRL,0)
// PSMC2PRL<PSMC2PR1>
extern volatile __bit                   PSMC2PR1            __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 PSMC2PR1_bit        _BIT_ACCESS(PSMC2PRL,1)
// PSMC2PRH<PSMC2PR10>
extern volatile __bit                   PSMC2PR10           __at(0x7632);	// @ (0xEC6 * 8 + 2)
#define                                 PSMC2PR10_bit       _BIT_ACCESS(PSMC2PRH,2)
// PSMC2PRH<PSMC2PR11>
extern volatile __bit                   PSMC2PR11           __at(0x7633);	// @ (0xEC6 * 8 + 3)
#define                                 PSMC2PR11_bit       _BIT_ACCESS(PSMC2PRH,3)
// PSMC2PRH<PSMC2PR12>
extern volatile __bit                   PSMC2PR12           __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 PSMC2PR12_bit       _BIT_ACCESS(PSMC2PRH,4)
// PSMC2PRH<PSMC2PR13>
extern volatile __bit                   PSMC2PR13           __at(0x7635);	// @ (0xEC6 * 8 + 5)
#define                                 PSMC2PR13_bit       _BIT_ACCESS(PSMC2PRH,5)
// PSMC2PRH<PSMC2PR14>
extern volatile __bit                   PSMC2PR14           __at(0x7636);	// @ (0xEC6 * 8 + 6)
#define                                 PSMC2PR14_bit       _BIT_ACCESS(PSMC2PRH,6)
// PSMC2PRH<PSMC2PR15>
extern volatile __bit                   PSMC2PR15           __at(0x7637);	// @ (0xEC6 * 8 + 7)
#define                                 PSMC2PR15_bit       _BIT_ACCESS(PSMC2PRH,7)
// PSMC2PRL<PSMC2PR2>
extern volatile __bit                   PSMC2PR2            __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 PSMC2PR2_bit        _BIT_ACCESS(PSMC2PRL,2)
// PSMC2PRL<PSMC2PR3>
extern volatile __bit                   PSMC2PR3            __at(0x762B);	// @ (0xEC5 * 8 + 3)
#define                                 PSMC2PR3_bit        _BIT_ACCESS(PSMC2PRL,3)
// PSMC2PRL<PSMC2PR4>
extern volatile __bit                   PSMC2PR4            __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 PSMC2PR4_bit        _BIT_ACCESS(PSMC2PRL,4)
// PSMC2PRL<PSMC2PR5>
extern volatile __bit                   PSMC2PR5            __at(0x762D);	// @ (0xEC5 * 8 + 5)
#define                                 PSMC2PR5_bit        _BIT_ACCESS(PSMC2PRL,5)
// PSMC2PRL<PSMC2PR6>
extern volatile __bit                   PSMC2PR6            __at(0x762E);	// @ (0xEC5 * 8 + 6)
#define                                 PSMC2PR6_bit        _BIT_ACCESS(PSMC2PRL,6)
// PSMC2PRL<PSMC2PR7>
extern volatile __bit                   PSMC2PR7            __at(0x762F);	// @ (0xEC5 * 8 + 7)
#define                                 PSMC2PR7_bit        _BIT_ACCESS(PSMC2PRL,7)
// PSMC2PRH<PSMC2PR8>
extern volatile __bit                   PSMC2PR8            __at(0x7630);	// @ (0xEC6 * 8 + 0)
#define                                 PSMC2PR8_bit        _BIT_ACCESS(PSMC2PRH,0)
// PSMC2PRH<PSMC2PR9>
extern volatile __bit                   PSMC2PR9            __at(0x7631);	// @ (0xEC6 * 8 + 1)
#define                                 PSMC2PR9_bit        _BIT_ACCESS(PSMC2PRH,1)
// PIE4<PSMC2SIE>
extern volatile __bit                   PSMC2SIE            __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 PSMC2SIE_bit        _BIT_ACCESS(PIE4,1)
// PIR4<PSMC2SIF>
extern volatile __bit                   PSMC2SIF            __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 PSMC2SIF_bit        _BIT_ACCESS(PIR4,1)
// PIE4<PSMC2TIE>
extern volatile __bit                   PSMC2TIE            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 PSMC2TIE_bit        _BIT_ACCESS(PIE4,5)
// PIR4<PSMC2TIF>
extern volatile __bit                   PSMC2TIF            __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 PSMC2TIF_bit        _BIT_ACCESS(PIR4,5)
// PSMC2TMRL<PSMC2TMR0>
extern volatile __bit                   PSMC2TMR0           __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 PSMC2TMR0_bit       _BIT_ACCESS(PSMC2TMRL,0)
// PSMC2TMRL<PSMC2TMR1>
extern volatile __bit                   PSMC2TMR1           __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 PSMC2TMR1_bit       _BIT_ACCESS(PSMC2TMRL,1)
// PSMC2TMRH<PSMC2TMR10>
extern volatile __bit                   PSMC2TMR10          __at(0x7642);	// @ (0xEC8 * 8 + 2)
#define                                 PSMC2TMR10_bit      _BIT_ACCESS(PSMC2TMRH,2)
// PSMC2TMRH<PSMC2TMR11>
extern volatile __bit                   PSMC2TMR11          __at(0x7643);	// @ (0xEC8 * 8 + 3)
#define                                 PSMC2TMR11_bit      _BIT_ACCESS(PSMC2TMRH,3)
// PSMC2TMRH<PSMC2TMR12>
extern volatile __bit                   PSMC2TMR12          __at(0x7644);	// @ (0xEC8 * 8 + 4)
#define                                 PSMC2TMR12_bit      _BIT_ACCESS(PSMC2TMRH,4)
// PSMC2TMRH<PSMC2TMR13>
extern volatile __bit                   PSMC2TMR13          __at(0x7645);	// @ (0xEC8 * 8 + 5)
#define                                 PSMC2TMR13_bit      _BIT_ACCESS(PSMC2TMRH,5)
// PSMC2TMRH<PSMC2TMR14>
extern volatile __bit                   PSMC2TMR14          __at(0x7646);	// @ (0xEC8 * 8 + 6)
#define                                 PSMC2TMR14_bit      _BIT_ACCESS(PSMC2TMRH,6)
// PSMC2TMRH<PSMC2TMR15>
extern volatile __bit                   PSMC2TMR15          __at(0x7647);	// @ (0xEC8 * 8 + 7)
#define                                 PSMC2TMR15_bit      _BIT_ACCESS(PSMC2TMRH,7)
// PSMC2TMRL<PSMC2TMR2>
extern volatile __bit                   PSMC2TMR2           __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 PSMC2TMR2_bit       _BIT_ACCESS(PSMC2TMRL,2)
// PSMC2TMRL<PSMC2TMR3>
extern volatile __bit                   PSMC2TMR3           __at(0x763B);	// @ (0xEC7 * 8 + 3)
#define                                 PSMC2TMR3_bit       _BIT_ACCESS(PSMC2TMRL,3)
// PSMC2TMRL<PSMC2TMR4>
extern volatile __bit                   PSMC2TMR4           __at(0x763C);	// @ (0xEC7 * 8 + 4)
#define                                 PSMC2TMR4_bit       _BIT_ACCESS(PSMC2TMRL,4)
// PSMC2TMRL<PSMC2TMR5>
extern volatile __bit                   PSMC2TMR5           __at(0x763D);	// @ (0xEC7 * 8 + 5)
#define                                 PSMC2TMR5_bit       _BIT_ACCESS(PSMC2TMRL,5)
// PSMC2TMRL<PSMC2TMR6>
extern volatile __bit                   PSMC2TMR6           __at(0x763E);	// @ (0xEC7 * 8 + 6)
#define                                 PSMC2TMR6_bit       _BIT_ACCESS(PSMC2TMRL,6)
// PSMC2TMRL<PSMC2TMR7>
extern volatile __bit                   PSMC2TMR7           __at(0x763F);	// @ (0xEC7 * 8 + 7)
#define                                 PSMC2TMR7_bit       _BIT_ACCESS(PSMC2TMRL,7)
// PSMC2TMRH<PSMC2TMR8>
extern volatile __bit                   PSMC2TMR8           __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 PSMC2TMR8_bit       _BIT_ACCESS(PSMC2TMRH,0)
// PSMC2TMRH<PSMC2TMR9>
extern volatile __bit                   PSMC2TMR9           __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 PSMC2TMR9_bit       _BIT_ACCESS(PSMC2TMRH,1)
// PSMC3BLKF<PSMC3BLKF0>
extern volatile __bit                   PSMC3BLKF0          __at(0x7760);	// @ (0xEEC * 8 + 0)
#define                                 PSMC3BLKF0_bit      _BIT_ACCESS(PSMC3BLKF,0)
// PSMC3BLKF<PSMC3BLKF1>
extern volatile __bit                   PSMC3BLKF1          __at(0x7761);	// @ (0xEEC * 8 + 1)
#define                                 PSMC3BLKF1_bit      _BIT_ACCESS(PSMC3BLKF,1)
// PSMC3BLKF<PSMC3BLKF2>
extern volatile __bit                   PSMC3BLKF2          __at(0x7762);	// @ (0xEEC * 8 + 2)
#define                                 PSMC3BLKF2_bit      _BIT_ACCESS(PSMC3BLKF,2)
// PSMC3BLKF<PSMC3BLKF3>
extern volatile __bit                   PSMC3BLKF3          __at(0x7763);	// @ (0xEEC * 8 + 3)
#define                                 PSMC3BLKF3_bit      _BIT_ACCESS(PSMC3BLKF,3)
// PSMC3BLKF<PSMC3BLKF4>
extern volatile __bit                   PSMC3BLKF4          __at(0x7764);	// @ (0xEEC * 8 + 4)
#define                                 PSMC3BLKF4_bit      _BIT_ACCESS(PSMC3BLKF,4)
// PSMC3BLKF<PSMC3BLKF5>
extern volatile __bit                   PSMC3BLKF5          __at(0x7765);	// @ (0xEEC * 8 + 5)
#define                                 PSMC3BLKF5_bit      _BIT_ACCESS(PSMC3BLKF,5)
// PSMC3BLKF<PSMC3BLKF6>
extern volatile __bit                   PSMC3BLKF6          __at(0x7766);	// @ (0xEEC * 8 + 6)
#define                                 PSMC3BLKF6_bit      _BIT_ACCESS(PSMC3BLKF,6)
// PSMC3BLKF<PSMC3BLKF7>
extern volatile __bit                   PSMC3BLKF7          __at(0x7767);	// @ (0xEEC * 8 + 7)
#define                                 PSMC3BLKF7_bit      _BIT_ACCESS(PSMC3BLKF,7)
// PSMC3BLKR<PSMC3BLKR0>
extern volatile __bit                   PSMC3BLKR0          __at(0x7758);	// @ (0xEEB * 8 + 0)
#define                                 PSMC3BLKR0_bit      _BIT_ACCESS(PSMC3BLKR,0)
// PSMC3BLKR<PSMC3BLKR1>
extern volatile __bit                   PSMC3BLKR1          __at(0x7759);	// @ (0xEEB * 8 + 1)
#define                                 PSMC3BLKR1_bit      _BIT_ACCESS(PSMC3BLKR,1)
// PSMC3BLKR<PSMC3BLKR2>
extern volatile __bit                   PSMC3BLKR2          __at(0x775A);	// @ (0xEEB * 8 + 2)
#define                                 PSMC3BLKR2_bit      _BIT_ACCESS(PSMC3BLKR,2)
// PSMC3BLKR<PSMC3BLKR3>
extern volatile __bit                   PSMC3BLKR3          __at(0x775B);	// @ (0xEEB * 8 + 3)
#define                                 PSMC3BLKR3_bit      _BIT_ACCESS(PSMC3BLKR,3)
// PSMC3BLKR<PSMC3BLKR4>
extern volatile __bit                   PSMC3BLKR4          __at(0x775C);	// @ (0xEEB * 8 + 4)
#define                                 PSMC3BLKR4_bit      _BIT_ACCESS(PSMC3BLKR,4)
// PSMC3BLKR<PSMC3BLKR5>
extern volatile __bit                   PSMC3BLKR5          __at(0x775D);	// @ (0xEEB * 8 + 5)
#define                                 PSMC3BLKR5_bit      _BIT_ACCESS(PSMC3BLKR,5)
// PSMC3BLKR<PSMC3BLKR6>
