MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1789/mcu.h
extern volatile __bit                   PSMC3BLKR6          __at(0x775E);	// @ (0xEEB * 8 + 6)
#define                                 PSMC3BLKR6_bit      _BIT_ACCESS(PSMC3BLKR,6)
// PSMC3BLKR<PSMC3BLKR7>
extern volatile __bit                   PSMC3BLKR7          __at(0x775F);	// @ (0xEEB * 8 + 7)
#define                                 PSMC3BLKR7_bit      _BIT_ACCESS(PSMC3BLKR,7)
// PSMC3DBF<PSMC3DBF0>
extern volatile __bit                   PSMC3DBF0           __at(0x7750);	// @ (0xEEA * 8 + 0)
#define                                 PSMC3DBF0_bit       _BIT_ACCESS(PSMC3DBF,0)
// PSMC3DBF<PSMC3DBF1>
extern volatile __bit                   PSMC3DBF1           __at(0x7751);	// @ (0xEEA * 8 + 1)
#define                                 PSMC3DBF1_bit       _BIT_ACCESS(PSMC3DBF,1)
// PSMC3DBF<PSMC3DBF2>
extern volatile __bit                   PSMC3DBF2           __at(0x7752);	// @ (0xEEA * 8 + 2)
#define                                 PSMC3DBF2_bit       _BIT_ACCESS(PSMC3DBF,2)
// PSMC3DBF<PSMC3DBF3>
extern volatile __bit                   PSMC3DBF3           __at(0x7753);	// @ (0xEEA * 8 + 3)
#define                                 PSMC3DBF3_bit       _BIT_ACCESS(PSMC3DBF,3)
// PSMC3DBF<PSMC3DBF4>
extern volatile __bit                   PSMC3DBF4           __at(0x7754);	// @ (0xEEA * 8 + 4)
#define                                 PSMC3DBF4_bit       _BIT_ACCESS(PSMC3DBF,4)
// PSMC3DBF<PSMC3DBF5>
extern volatile __bit                   PSMC3DBF5           __at(0x7755);	// @ (0xEEA * 8 + 5)
#define                                 PSMC3DBF5_bit       _BIT_ACCESS(PSMC3DBF,5)
// PSMC3DBF<PSMC3DBF6>
extern volatile __bit                   PSMC3DBF6           __at(0x7756);	// @ (0xEEA * 8 + 6)
#define                                 PSMC3DBF6_bit       _BIT_ACCESS(PSMC3DBF,6)
// PSMC3DBF<PSMC3DBF7>
extern volatile __bit                   PSMC3DBF7           __at(0x7757);	// @ (0xEEA * 8 + 7)
#define                                 PSMC3DBF7_bit       _BIT_ACCESS(PSMC3DBF,7)
// PSMC3DBR<PSMC3DBR0>
extern volatile __bit                   PSMC3DBR0           __at(0x7748);	// @ (0xEE9 * 8 + 0)
#define                                 PSMC3DBR0_bit       _BIT_ACCESS(PSMC3DBR,0)
// PSMC3DBR<PSMC3DBR1>
extern volatile __bit                   PSMC3DBR1           __at(0x7749);	// @ (0xEE9 * 8 + 1)
#define                                 PSMC3DBR1_bit       _BIT_ACCESS(PSMC3DBR,1)
// PSMC3DBR<PSMC3DBR2>
extern volatile __bit                   PSMC3DBR2           __at(0x774A);	// @ (0xEE9 * 8 + 2)
#define                                 PSMC3DBR2_bit       _BIT_ACCESS(PSMC3DBR,2)
// PSMC3DBR<PSMC3DBR3>
extern volatile __bit                   PSMC3DBR3           __at(0x774B);	// @ (0xEE9 * 8 + 3)
#define                                 PSMC3DBR3_bit       _BIT_ACCESS(PSMC3DBR,3)
// PSMC3DBR<PSMC3DBR4>
extern volatile __bit                   PSMC3DBR4           __at(0x774C);	// @ (0xEE9 * 8 + 4)
#define                                 PSMC3DBR4_bit       _BIT_ACCESS(PSMC3DBR,4)
// PSMC3DBR<PSMC3DBR5>
extern volatile __bit                   PSMC3DBR5           __at(0x774D);	// @ (0xEE9 * 8 + 5)
#define                                 PSMC3DBR5_bit       _BIT_ACCESS(PSMC3DBR,5)
// PSMC3DBR<PSMC3DBR6>
extern volatile __bit                   PSMC3DBR6           __at(0x774E);	// @ (0xEE9 * 8 + 6)
#define                                 PSMC3DBR6_bit       _BIT_ACCESS(PSMC3DBR,6)
// PSMC3DBR<PSMC3DBR7>
extern volatile __bit                   PSMC3DBR7           __at(0x774F);	// @ (0xEE9 * 8 + 7)
#define                                 PSMC3DBR7_bit       _BIT_ACCESS(PSMC3DBR,7)
// PSMC3DCL<PSMC3DC0>
extern volatile __bit                   PSMC3DC0            __at(0x7718);	// @ (0xEE3 * 8 + 0)
#define                                 PSMC3DC0_bit        _BIT_ACCESS(PSMC3DCL,0)
// PSMC3DCL<PSMC3DC1>
extern volatile __bit                   PSMC3DC1            __at(0x7719);	// @ (0xEE3 * 8 + 1)
#define                                 PSMC3DC1_bit        _BIT_ACCESS(PSMC3DCL,1)
// PSMC3DCH<PSMC3DC10>
extern volatile __bit                   PSMC3DC10           __at(0x7722);	// @ (0xEE4 * 8 + 2)
#define                                 PSMC3DC10_bit       _BIT_ACCESS(PSMC3DCH,2)
// PSMC3DCH<PSMC3DC11>
extern volatile __bit                   PSMC3DC11           __at(0x7723);	// @ (0xEE4 * 8 + 3)
#define                                 PSMC3DC11_bit       _BIT_ACCESS(PSMC3DCH,3)
// PSMC3DCH<PSMC3DC12>
extern volatile __bit                   PSMC3DC12           __at(0x7724);	// @ (0xEE4 * 8 + 4)
#define                                 PSMC3DC12_bit       _BIT_ACCESS(PSMC3DCH,4)
// PSMC3DCH<PSMC3DC13>
extern volatile __bit                   PSMC3DC13           __at(0x7725);	// @ (0xEE4 * 8 + 5)
#define                                 PSMC3DC13_bit       _BIT_ACCESS(PSMC3DCH,5)
// PSMC3DCH<PSMC3DC14>
extern volatile __bit                   PSMC3DC14           __at(0x7726);	// @ (0xEE4 * 8 + 6)
#define                                 PSMC3DC14_bit       _BIT_ACCESS(PSMC3DCH,6)
// PSMC3DCH<PSMC3DC15>
extern volatile __bit                   PSMC3DC15           __at(0x7727);	// @ (0xEE4 * 8 + 7)
#define                                 PSMC3DC15_bit       _BIT_ACCESS(PSMC3DCH,7)
// PSMC3DCL<PSMC3DC2>
extern volatile __bit                   PSMC3DC2            __at(0x771A);	// @ (0xEE3 * 8 + 2)
#define                                 PSMC3DC2_bit        _BIT_ACCESS(PSMC3DCL,2)
// PSMC3DCL<PSMC3DC3>
extern volatile __bit                   PSMC3DC3            __at(0x771B);	// @ (0xEE3 * 8 + 3)
#define                                 PSMC3DC3_bit        _BIT_ACCESS(PSMC3DCL,3)
// PSMC3DCL<PSMC3DC4>
extern volatile __bit                   PSMC3DC4            __at(0x771C);	// @ (0xEE3 * 8 + 4)
#define                                 PSMC3DC4_bit        _BIT_ACCESS(PSMC3DCL,4)
// PSMC3DCL<PSMC3DC5>
extern volatile __bit                   PSMC3DC5            __at(0x771D);	// @ (0xEE3 * 8 + 5)
#define                                 PSMC3DC5_bit        _BIT_ACCESS(PSMC3DCL,5)
// PSMC3DCL<PSMC3DC6>
extern volatile __bit                   PSMC3DC6            __at(0x771E);	// @ (0xEE3 * 8 + 6)
#define                                 PSMC3DC6_bit        _BIT_ACCESS(PSMC3DCL,6)
// PSMC3DCL<PSMC3DC7>
extern volatile __bit                   PSMC3DC7            __at(0x771F);	// @ (0xEE3 * 8 + 7)
#define                                 PSMC3DC7_bit        _BIT_ACCESS(PSMC3DCL,7)
// PSMC3DCH<PSMC3DC8>
extern volatile __bit                   PSMC3DC8            __at(0x7720);	// @ (0xEE4 * 8 + 0)
#define                                 PSMC3DC8_bit        _BIT_ACCESS(PSMC3DCH,0)
// PSMC3DCH<PSMC3DC9>
extern volatile __bit                   PSMC3DC9            __at(0x7721);	// @ (0xEE4 * 8 + 1)
#define                                 PSMC3DC9_bit        _BIT_ACCESS(PSMC3DCH,1)
// PSMC3CON<PSMC3EN>
extern volatile __bit                   PSMC3EN             __at(0x768F);	// @ (0xED1 * 8 + 7)
#define                                 PSMC3EN_bit         _BIT_ACCESS(PSMC3CON,7)
// PSMC3FFA<PSMC3FFA0>
extern volatile __bit                   PSMC3FFA0           __at(0x7768);	// @ (0xEED * 8 + 0)
#define                                 PSMC3FFA0_bit       _BIT_ACCESS(PSMC3FFA,0)
// PSMC3FFA<PSMC3FFA1>
extern volatile __bit                   PSMC3FFA1           __at(0x7769);	// @ (0xEED * 8 + 1)
#define                                 PSMC3FFA1_bit       _BIT_ACCESS(PSMC3FFA,1)
// PSMC3FFA<PSMC3FFA2>
extern volatile __bit                   PSMC3FFA2           __at(0x776A);	// @ (0xEED * 8 + 2)
#define                                 PSMC3FFA2_bit       _BIT_ACCESS(PSMC3FFA,2)
// PSMC3FFA<PSMC3FFA3>
extern volatile __bit                   PSMC3FFA3           __at(0x776B);	// @ (0xEED * 8 + 3)
#define                                 PSMC3FFA3_bit       _BIT_ACCESS(PSMC3FFA,3)
// PSMC3CON<PSMC3LD>
extern volatile __bit                   PSMC3LD             __at(0x768E);	// @ (0xED1 * 8 + 6)
#define                                 PSMC3LD_bit         _BIT_ACCESS(PSMC3CON,6)
// PSMC3PHL<PSMC3PH0>
extern volatile __bit                   PSMC3PH0            __at(0x7708);	// @ (0xEE1 * 8 + 0)
#define                                 PSMC3PH0_bit        _BIT_ACCESS(PSMC3PHL,0)
// PSMC3PHL<PSMC3PH1>
extern volatile __bit                   PSMC3PH1            __at(0x7709);	// @ (0xEE1 * 8 + 1)
#define                                 PSMC3PH1_bit        _BIT_ACCESS(PSMC3PHL,1)
// PSMC3PHH<PSMC3PH10>
extern volatile __bit                   PSMC3PH10           __at(0x7712);	// @ (0xEE2 * 8 + 2)
#define                                 PSMC3PH10_bit       _BIT_ACCESS(PSMC3PHH,2)
// PSMC3PHH<PSMC3PH11>
extern volatile __bit                   PSMC3PH11           __at(0x7713);	// @ (0xEE2 * 8 + 3)
#define                                 PSMC3PH11_bit       _BIT_ACCESS(PSMC3PHH,3)
// PSMC3PHH<PSMC3PH12>
extern volatile __bit                   PSMC3PH12           __at(0x7714);	// @ (0xEE2 * 8 + 4)
#define                                 PSMC3PH12_bit       _BIT_ACCESS(PSMC3PHH,4)
// PSMC3PHH<PSMC3PH13>
extern volatile __bit                   PSMC3PH13           __at(0x7715);	// @ (0xEE2 * 8 + 5)
#define                                 PSMC3PH13_bit       _BIT_ACCESS(PSMC3PHH,5)
// PSMC3PHH<PSMC3PH14>
extern volatile __bit                   PSMC3PH14           __at(0x7716);	// @ (0xEE2 * 8 + 6)
#define                                 PSMC3PH14_bit       _BIT_ACCESS(PSMC3PHH,6)
// PSMC3PHH<PSMC3PH15>
extern volatile __bit                   PSMC3PH15           __at(0x7717);	// @ (0xEE2 * 8 + 7)
#define                                 PSMC3PH15_bit       _BIT_ACCESS(PSMC3PHH,7)
// PSMC3PHL<PSMC3PH2>
extern volatile __bit                   PSMC3PH2            __at(0x770A);	// @ (0xEE1 * 8 + 2)
#define                                 PSMC3PH2_bit        _BIT_ACCESS(PSMC3PHL,2)
// PSMC3PHL<PSMC3PH3>
extern volatile __bit                   PSMC3PH3            __at(0x770B);	// @ (0xEE1 * 8 + 3)
#define                                 PSMC3PH3_bit        _BIT_ACCESS(PSMC3PHL,3)
// PSMC3PHL<PSMC3PH4>
extern volatile __bit                   PSMC3PH4            __at(0x770C);	// @ (0xEE1 * 8 + 4)
#define                                 PSMC3PH4_bit        _BIT_ACCESS(PSMC3PHL,4)
// PSMC3PHL<PSMC3PH5>
extern volatile __bit                   PSMC3PH5            __at(0x770D);	// @ (0xEE1 * 8 + 5)
#define                                 PSMC3PH5_bit        _BIT_ACCESS(PSMC3PHL,5)
// PSMC3PHL<PSMC3PH6>
extern volatile __bit                   PSMC3PH6            __at(0x770E);	// @ (0xEE1 * 8 + 6)
#define                                 PSMC3PH6_bit        _BIT_ACCESS(PSMC3PHL,6)
// PSMC3PHL<PSMC3PH7>
extern volatile __bit                   PSMC3PH7            __at(0x770F);	// @ (0xEE1 * 8 + 7)
#define                                 PSMC3PH7_bit        _BIT_ACCESS(PSMC3PHL,7)
// PSMC3PHH<PSMC3PH8>
extern volatile __bit                   PSMC3PH8            __at(0x7710);	// @ (0xEE2 * 8 + 0)
#define                                 PSMC3PH8_bit        _BIT_ACCESS(PSMC3PHH,0)
// PSMC3PHH<PSMC3PH9>
extern volatile __bit                   PSMC3PH9            __at(0x7711);	// @ (0xEE2 * 8 + 1)
#define                                 PSMC3PH9_bit        _BIT_ACCESS(PSMC3PHH,1)
// PSMC3PRL<PSMC3PR0>
extern volatile __bit                   PSMC3PR0            __at(0x7728);	// @ (0xEE5 * 8 + 0)
#define                                 PSMC3PR0_bit        _BIT_ACCESS(PSMC3PRL,0)
// PSMC3PRL<PSMC3PR1>
extern volatile __bit                   PSMC3PR1            __at(0x7729);	// @ (0xEE5 * 8 + 1)
#define                                 PSMC3PR1_bit        _BIT_ACCESS(PSMC3PRL,1)
// PSMC3PRH<PSMC3PR10>
extern volatile __bit                   PSMC3PR10           __at(0x7732);	// @ (0xEE6 * 8 + 2)
#define                                 PSMC3PR10_bit       _BIT_ACCESS(PSMC3PRH,2)
// PSMC3PRH<PSMC3PR11>
extern volatile __bit                   PSMC3PR11           __at(0x7733);	// @ (0xEE6 * 8 + 3)
#define                                 PSMC3PR11_bit       _BIT_ACCESS(PSMC3PRH,3)
// PSMC3PRH<PSMC3PR12>
extern volatile __bit                   PSMC3PR12           __at(0x7734);	// @ (0xEE6 * 8 + 4)
#define                                 PSMC3PR12_bit       _BIT_ACCESS(PSMC3PRH,4)
// PSMC3PRH<PSMC3PR13>
extern volatile __bit                   PSMC3PR13           __at(0x7735);	// @ (0xEE6 * 8 + 5)
#define                                 PSMC3PR13_bit       _BIT_ACCESS(PSMC3PRH,5)
// PSMC3PRH<PSMC3PR14>
extern volatile __bit                   PSMC3PR14           __at(0x7736);	// @ (0xEE6 * 8 + 6)
#define                                 PSMC3PR14_bit       _BIT_ACCESS(PSMC3PRH,6)
// PSMC3PRH<PSMC3PR15>
extern volatile __bit                   PSMC3PR15           __at(0x7737);	// @ (0xEE6 * 8 + 7)
#define                                 PSMC3PR15_bit       _BIT_ACCESS(PSMC3PRH,7)
// PSMC3PRL<PSMC3PR2>
extern volatile __bit                   PSMC3PR2            __at(0x772A);	// @ (0xEE5 * 8 + 2)
#define                                 PSMC3PR2_bit        _BIT_ACCESS(PSMC3PRL,2)
// PSMC3PRL<PSMC3PR3>
extern volatile __bit                   PSMC3PR3            __at(0x772B);	// @ (0xEE5 * 8 + 3)
#define                                 PSMC3PR3_bit        _BIT_ACCESS(PSMC3PRL,3)
// PSMC3PRL<PSMC3PR4>
extern volatile __bit                   PSMC3PR4            __at(0x772C);	// @ (0xEE5 * 8 + 4)
#define                                 PSMC3PR4_bit        _BIT_ACCESS(PSMC3PRL,4)
// PSMC3PRL<PSMC3PR5>
extern volatile __bit                   PSMC3PR5            __at(0x772D);	// @ (0xEE5 * 8 + 5)
#define                                 PSMC3PR5_bit        _BIT_ACCESS(PSMC3PRL,5)
// PSMC3PRL<PSMC3PR6>
extern volatile __bit                   PSMC3PR6            __at(0x772E);	// @ (0xEE5 * 8 + 6)
#define                                 PSMC3PR6_bit        _BIT_ACCESS(PSMC3PRL,6)
// PSMC3PRL<PSMC3PR7>
extern volatile __bit                   PSMC3PR7            __at(0x772F);	// @ (0xEE5 * 8 + 7)
#define                                 PSMC3PR7_bit        _BIT_ACCESS(PSMC3PRL,7)
// PSMC3PRH<PSMC3PR8>
extern volatile __bit                   PSMC3PR8            __at(0x7730);	// @ (0xEE6 * 8 + 0)
#define                                 PSMC3PR8_bit        _BIT_ACCESS(PSMC3PRH,0)
// PSMC3PRH<PSMC3PR9>
extern volatile __bit                   PSMC3PR9            __at(0x7731);	// @ (0xEE6 * 8 + 1)
#define                                 PSMC3PR9_bit        _BIT_ACCESS(PSMC3PRH,1)
// PIE4<PSMC3SIE>
extern volatile __bit                   PSMC3SIE            __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 PSMC3SIE_bit        _BIT_ACCESS(PIE4,2)
// PIR4<PSMC3SIF>
extern volatile __bit                   PSMC3SIF            __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 PSMC3SIF_bit        _BIT_ACCESS(PIR4,2)
// PIE4<PSMC3TIE>
extern volatile __bit                   PSMC3TIE            __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 PSMC3TIE_bit        _BIT_ACCESS(PIE4,6)
// PIR4<PSMC3TIF>
extern volatile __bit                   PSMC3TIF            __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 PSMC3TIF_bit        _BIT_ACCESS(PIR4,6)
// PSMC3TMRL<PSMC3TMR0>
extern volatile __bit                   PSMC3TMR0           __at(0x7738);	// @ (0xEE7 * 8 + 0)
#define                                 PSMC3TMR0_bit       _BIT_ACCESS(PSMC3TMRL,0)
// PSMC3TMRL<PSMC3TMR1>
extern volatile __bit                   PSMC3TMR1           __at(0x7739);	// @ (0xEE7 * 8 + 1)
#define                                 PSMC3TMR1_bit       _BIT_ACCESS(PSMC3TMRL,1)
// PSMC3TMRH<PSMC3TMR10>
extern volatile __bit                   PSMC3TMR10          __at(0x7742);	// @ (0xEE8 * 8 + 2)
#define                                 PSMC3TMR10_bit      _BIT_ACCESS(PSMC3TMRH,2)
// PSMC3TMRH<PSMC3TMR11>
extern volatile __bit                   PSMC3TMR11          __at(0x7743);	// @ (0xEE8 * 8 + 3)
#define                                 PSMC3TMR11_bit      _BIT_ACCESS(PSMC3TMRH,3)
// PSMC3TMRH<PSMC3TMR12>
extern volatile __bit                   PSMC3TMR12          __at(0x7744);	// @ (0xEE8 * 8 + 4)
#define                                 PSMC3TMR12_bit      _BIT_ACCESS(PSMC3TMRH,4)
// PSMC3TMRH<PSMC3TMR13>
extern volatile __bit                   PSMC3TMR13          __at(0x7745);	// @ (0xEE8 * 8 + 5)
#define                                 PSMC3TMR13_bit      _BIT_ACCESS(PSMC3TMRH,5)
// PSMC3TMRH<PSMC3TMR14>
extern volatile __bit                   PSMC3TMR14          __at(0x7746);	// @ (0xEE8 * 8 + 6)
#define                                 PSMC3TMR14_bit      _BIT_ACCESS(PSMC3TMRH,6)
// PSMC3TMRH<PSMC3TMR15>
extern volatile __bit                   PSMC3TMR15          __at(0x7747);	// @ (0xEE8 * 8 + 7)
#define                                 PSMC3TMR15_bit      _BIT_ACCESS(PSMC3TMRH,7)
// PSMC3TMRL<PSMC3TMR2>
extern volatile __bit                   PSMC3TMR2           __at(0x773A);	// @ (0xEE7 * 8 + 2)
#define                                 PSMC3TMR2_bit       _BIT_ACCESS(PSMC3TMRL,2)
// PSMC3TMRL<PSMC3TMR3>
extern volatile __bit                   PSMC3TMR3           __at(0x773B);	// @ (0xEE7 * 8 + 3)
#define                                 PSMC3TMR3_bit       _BIT_ACCESS(PSMC3TMRL,3)
// PSMC3TMRL<PSMC3TMR4>
extern volatile __bit                   PSMC3TMR4           __at(0x773C);	// @ (0xEE7 * 8 + 4)
#define                                 PSMC3TMR4_bit       _BIT_ACCESS(PSMC3TMRL,4)
// PSMC3TMRL<PSMC3TMR5>
extern volatile __bit                   PSMC3TMR5           __at(0x773D);	// @ (0xEE7 * 8 + 5)
#define                                 PSMC3TMR5_bit       _BIT_ACCESS(PSMC3TMRL,5)
// PSMC3TMRL<PSMC3TMR6>
extern volatile __bit                   PSMC3TMR6           __at(0x773E);	// @ (0xEE7 * 8 + 6)
#define                                 PSMC3TMR6_bit       _BIT_ACCESS(PSMC3TMRL,6)
// PSMC3TMRL<PSMC3TMR7>
extern volatile __bit                   PSMC3TMR7           __at(0x773F);	// @ (0xEE7 * 8 + 7)
#define                                 PSMC3TMR7_bit       _BIT_ACCESS(PSMC3TMRL,7)
// PSMC3TMRH<PSMC3TMR8>
extern volatile __bit                   PSMC3TMR8           __at(0x7740);	// @ (0xEE8 * 8 + 0)
#define                                 PSMC3TMR8_bit       _BIT_ACCESS(PSMC3TMRH,0)
// PSMC3TMRH<PSMC3TMR9>
extern volatile __bit                   PSMC3TMR9           __at(0x7741);	// @ (0xEE8 * 8 + 1)
#define                                 PSMC3TMR9_bit       _BIT_ACCESS(PSMC3TMRH,1)
// PSMC4BLKF<PSMC4BLKF0>
extern volatile __bit                   PSMC4BLKF0          __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 PSMC4BLKF0_bit      _BIT_ACCESS(PSMC4BLKF,0)
// PSMC4BLKF<PSMC4BLKF1>
extern volatile __bit                   PSMC4BLKF1          __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 PSMC4BLKF1_bit      _BIT_ACCESS(PSMC4BLKF,1)
// PSMC4BLKF<PSMC4BLKF2>
extern volatile __bit                   PSMC4BLKF2          __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 PSMC4BLKF2_bit      _BIT_ACCESS(PSMC4BLKF,2)
// PSMC4BLKF<PSMC4BLKF3>
extern volatile __bit                   PSMC4BLKF3          __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 PSMC4BLKF3_bit      _BIT_ACCESS(PSMC4BLKF,3)
// PSMC4BLKF<PSMC4BLKF4>
extern volatile __bit                   PSMC4BLKF4          __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 PSMC4BLKF4_bit      _BIT_ACCESS(PSMC4BLKF,4)
// PSMC4BLKF<PSMC4BLKF5>
extern volatile __bit                   PSMC4BLKF5          __at(0x7965);	// @ (0xF2C * 8 + 5)
#define                                 PSMC4BLKF5_bit      _BIT_ACCESS(PSMC4BLKF,5)
// PSMC4BLKF<PSMC4BLKF6>
extern volatile __bit                   PSMC4BLKF6          __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 PSMC4BLKF6_bit      _BIT_ACCESS(PSMC4BLKF,6)
// PSMC4BLKF<PSMC4BLKF7>
extern volatile __bit                   PSMC4BLKF7          __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 PSMC4BLKF7_bit      _BIT_ACCESS(PSMC4BLKF,7)
// PSMC4BLKR<PSMC4BLKR0>
extern volatile __bit                   PSMC4BLKR0          __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 PSMC4BLKR0_bit      _BIT_ACCESS(PSMC4BLKR,0)
// PSMC4BLKR<PSMC4BLKR1>
extern volatile __bit                   PSMC4BLKR1          __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 PSMC4BLKR1_bit      _BIT_ACCESS(PSMC4BLKR,1)
// PSMC4BLKR<PSMC4BLKR2>
extern volatile __bit                   PSMC4BLKR2          __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 PSMC4BLKR2_bit      _BIT_ACCESS(PSMC4BLKR,2)
// PSMC4BLKR<PSMC4BLKR3>
extern volatile __bit                   PSMC4BLKR3          __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 PSMC4BLKR3_bit      _BIT_ACCESS(PSMC4BLKR,3)
// PSMC4BLKR<PSMC4BLKR4>
extern volatile __bit                   PSMC4BLKR4          __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 PSMC4BLKR4_bit      _BIT_ACCESS(PSMC4BLKR,4)
// PSMC4BLKR<PSMC4BLKR5>
extern volatile __bit                   PSMC4BLKR5          __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 PSMC4BLKR5_bit      _BIT_ACCESS(PSMC4BLKR,5)
// PSMC4BLKR<PSMC4BLKR6>
extern volatile __bit                   PSMC4BLKR6          __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 PSMC4BLKR6_bit      _BIT_ACCESS(PSMC4BLKR,6)
// PSMC4BLKR<PSMC4BLKR7>
extern volatile __bit                   PSMC4BLKR7          __at(0x795F);	// @ (0xF2B * 8 + 7)
#define                                 PSMC4BLKR7_bit      _BIT_ACCESS(PSMC4BLKR,7)
// PSMC4DBF<PSMC4DBF0>
extern volatile __bit                   PSMC4DBF0           __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 PSMC4DBF0_bit       _BIT_ACCESS(PSMC4DBF,0)
// PSMC4DBF<PSMC4DBF1>
extern volatile __bit                   PSMC4DBF1           __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 PSMC4DBF1_bit       _BIT_ACCESS(PSMC4DBF,1)
// PSMC4DBF<PSMC4DBF2>
extern volatile __bit                   PSMC4DBF2           __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 PSMC4DBF2_bit       _BIT_ACCESS(PSMC4DBF,2)
// PSMC4DBF<PSMC4DBF3>
extern volatile __bit                   PSMC4DBF3           __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 PSMC4DBF3_bit       _BIT_ACCESS(PSMC4DBF,3)
// PSMC4DBF<PSMC4DBF4>
extern volatile __bit                   PSMC4DBF4           __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 PSMC4DBF4_bit       _BIT_ACCESS(PSMC4DBF,4)
// PSMC4DBF<PSMC4DBF5>
extern volatile __bit                   PSMC4DBF5           __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 PSMC4DBF5_bit       _BIT_ACCESS(PSMC4DBF,5)
// PSMC4DBF<PSMC4DBF6>
extern volatile __bit                   PSMC4DBF6           __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 PSMC4DBF6_bit       _BIT_ACCESS(PSMC4DBF,6)
// PSMC4DBF<PSMC4DBF7>
extern volatile __bit                   PSMC4DBF7           __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 PSMC4DBF7_bit       _BIT_ACCESS(PSMC4DBF,7)
// PSMC4DBR<PSMC4DBR0>
extern volatile __bit                   PSMC4DBR0           __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 PSMC4DBR0_bit       _BIT_ACCESS(PSMC4DBR,0)
// PSMC4DBR<PSMC4DBR1>
extern volatile __bit                   PSMC4DBR1           __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 PSMC4DBR1_bit       _BIT_ACCESS(PSMC4DBR,1)
// PSMC4DBR<PSMC4DBR2>
extern volatile __bit                   PSMC4DBR2           __at(0x794A);	// @ (0xF29 * 8 + 2)
